// jshint ignore: start
+function ($) {

  $.smConfig.rawTreeCitiesData =
    [{
      "c": "北京市",
      "d": [{"c": "东城区"}, {"c": "西城区"}, {"c": "朝阳区"}, {"c": "丰台区"}, {"c": "石景山区"}, {"c": "海淀区"}, {"c": "门头沟区"}, {"c": "房山区"}, {"c": "通州区"}, {"c": "顺义区"}, {"c": "昌平区"}, {"c": "大兴区"}, {"c": "怀柔区"}, {"c": "平谷区"}, {"c": "密云区"}, {"c": "延庆区"}]
    }, {
      "c": "天津市",
      "d": [{"c": "和平区"}, {"c": "河东区"}, {"c": "河西区"}, {"c": "南开区"}, {"c": "河北区"}, {"c": "红桥区"}, {"c": "东丽区"}, {"c": "西青区"}, {"c": "津南区"}, {"c": "北辰区"}, {"c": "武清区"}, {"c": "宝坻区"}, {"c": "滨海新区"}, {"c": "宁河区"}, {"c": "静海区"}, {"c": "蓟州区"}]
    }, {
      "c": "河北省",
      "d": [{
        "c": "石家庄市",
        "d": [{"c": "长安区"}, {"c": "桥西区"}, {"c": "新华区"}, {"c": "井陉矿区"}, {"c": "裕华区"}, {"c": "藁城区"}, {"c": "鹿泉区"}, {"c": "栾城区"}, {"c": "井陉县"}, {"c": "正定县"}, {"c": "行唐县"}, {"c": "灵寿县"}, {"c": "高邑县"}, {"c": "深泽县"}, {"c": "赞皇县"}, {"c": "无极县"}, {"c": "平山县"}, {"c": "元氏县"}, {"c": "赵县"}, {"c": "辛集市"}, {"c": "晋州市"}, {"c": "新乐市"}]
      }, {
        "c": "唐山市",
        "d": [{"c": "路南区"}, {"c": "路北区"}, {"c": "古冶区"}, {"c": "开平区"}, {"c": "丰南区"}, {"c": "丰润区"}, {"c": "曹妃甸区"}, {"c": "滦县"}, {"c": "滦南县"}, {"c": "乐亭县"}, {"c": "迁西县"}, {"c": "玉田县"}, {"c": "遵化市"}, {"c": "迁安市"}]
      }, {
        "c": "秦皇岛市",
        "d": [{"c": "海港区"}, {"c": "山海关区"}, {"c": "北戴河区"}, {"c": "抚宁区"}, {"c": "青龙满族自治县"}, {"c": "昌黎县"}, {"c": "卢龙县"}]
      }, {
        "c": "邯郸市",
        "d": [{"c": "邯山区"}, {"c": "丛台区"}, {"c": "复兴区"}, {"c": "峰峰矿区"}, {"c": "肥乡区"}, {"c": "永年区"}, {"c": "临漳县"}, {"c": "成安县"}, {"c": "大名县"}, {"c": "涉县"}, {"c": "磁县"}, {"c": "邱县"}, {"c": "鸡泽县"}, {"c": "广平县"}, {"c": "馆陶县"}, {"c": "魏县"}, {"c": "曲周县"}, {"c": "武安市"}]
      }, {
        "c": "邢台市",
        "d": [{"c": "桥东区"}, {"c": "桥西区"}, {"c": "邢台县"}, {"c": "临城县"}, {"c": "内丘县"}, {"c": "柏乡县"}, {"c": "隆尧县"}, {"c": "任县"}, {"c": "南和县"}, {"c": "宁晋县"}, {"c": "巨鹿县"}, {"c": "新河县"}, {"c": "广宗县"}, {"c": "平乡县"}, {"c": "威县"}, {"c": "清河县"}, {"c": "临西县"}, {"c": "南宫市"}, {"c": "沙河市"}]
      }, {
        "c": "保定市",
        "d": [{"c": "竞秀区"}, {"c": "莲池区"}, {"c": "满城区"}, {"c": "清苑区"}, {"c": "徐水区"}, {"c": "涞水县"}, {"c": "阜平县"}, {"c": "定兴县"}, {"c": "唐县"}, {"c": "高阳县"}, {"c": "容城县"}, {"c": "涞源县"}, {"c": "望都县"}, {"c": "安新县"}, {"c": "易县"}, {"c": "曲阳县"}, {"c": "蠡县"}, {"c": "顺平县"}, {"c": "博野县"}, {"c": "雄县"}, {"c": "涿州市"}, {"c": "定州市"}, {"c": "安国市"}, {"c": "高碑店市"}]
      }, {
        "c": "张家口市",
        "d": [{"c": "桥东区"}, {"c": "桥西区"}, {"c": "宣化区"}, {"c": "下花园区"}, {"c": "万全区"}, {"c": "崇礼区"}, {"c": "张北县"}, {"c": "康保县"}, {"c": "沽源县"}, {"c": "尚义县"}, {"c": "蔚县"}, {"c": "阳原县"}, {"c": "怀安县"}, {"c": "怀来县"}, {"c": "涿鹿县"}, {"c": "赤城县"}]
      }, {
        "c": "承德市",
        "d": [{"c": "双桥区"}, {"c": "双滦区"}, {"c": "鹰手营子矿区"}, {"c": "承德县"}, {"c": "兴隆县"}, {"c": "滦平县"}, {"c": "隆化县"}, {"c": "丰宁满族自治县"}, {"c": "宽城满族自治县"}, {"c": "围场满族蒙古族自治县"}, {"c": "平泉市"}]
      }, {
        "c": "沧州市",
        "d": [{"c": "新华区"}, {"c": "运河区"}, {"c": "沧县"}, {"c": "青县"}, {"c": "东光县"}, {"c": "海兴县"}, {"c": "盐山县"}, {"c": "肃宁县"}, {"c": "南皮县"}, {"c": "吴桥县"}, {"c": "献县"}, {"c": "孟村回族自治县"}, {"c": "泊头市"}, {"c": "任丘市"}, {"c": "黄骅市"}, {"c": "河间市"}]
      }, {
        "c": "廊坊市",
        "d": [{"c": "安次区"}, {"c": "广阳区"}, {"c": "固安县"}, {"c": "永清县"}, {"c": "香河县"}, {"c": "大城县"}, {"c": "文安县"}, {"c": "大厂回族自治县"}, {"c": "霸州市"}, {"c": "三河市"}]
      }, {
        "c": "衡水市",
        "d": [{"c": "桃城区"}, {"c": "冀州区"}, {"c": "枣强县"}, {"c": "武邑县"}, {"c": "武强县"}, {"c": "饶阳县"}, {"c": "安平县"}, {"c": "故城县"}, {"c": "景县"}, {"c": "阜城县"}, {"c": "深州市"}]
      }]
    }, {
      "c": "山西省",
      "d": [{
        "c": "太原市",
        "d": [{"c": "小店区"}, {"c": "迎泽区"}, {"c": "杏花岭区"}, {"c": "尖草坪区"}, {"c": "万柏林区"}, {"c": "晋源区"}, {"c": "清徐县"}, {"c": "阳曲县"}, {"c": "娄烦县"}, {"c": "古交市"}]
      }, {
        "c": "大同市",
        "d": [{"c": "城区"}, {"c": "矿区"}, {"c": "南郊区"}, {"c": "新荣区"}, {"c": "阳高县"}, {"c": "天镇县"}, {"c": "广灵县"}, {"c": "灵丘县"}, {"c": "浑源县"}, {"c": "左云县"}, {"c": "大同县"}]
      }, {"c": "阳泉市", "d": [{"c": "城区"}, {"c": "矿区"}, {"c": "郊区"}, {"c": "平定县"}, {"c": "盂县"}]}, {
        "c": "长治市",
        "d": [{"c": "城区"}, {"c": "郊区"}, {"c": "长治县"}, {"c": "襄垣县"}, {"c": "屯留县"}, {"c": "平顺县"}, {"c": "黎城县"}, {"c": "壶关县"}, {"c": "长子县"}, {"c": "武乡县"}, {"c": "沁县"}, {"c": "沁源县"}, {"c": "潞城市"}]
      }, {
        "c": "晋城市",
        "d": [{"c": "城区"}, {"c": "沁水县"}, {"c": "阳城县"}, {"c": "陵川县"}, {"c": "泽州县"}, {"c": "高平市"}]
      }, {
        "c": "朔州市",
        "d": [{"c": "朔城区"}, {"c": "平鲁区"}, {"c": "山阴县"}, {"c": "应县"}, {"c": "右玉县"}, {"c": "怀仁县"}]
      }, {
        "c": "晋中市",
        "d": [{"c": "榆次区"}, {"c": "榆社县"}, {"c": "左权县"}, {"c": "和顺县"}, {"c": "昔阳县"}, {"c": "寿阳县"}, {"c": "太谷县"}, {"c": "祁县"}, {"c": "平遥县"}, {"c": "灵石县"}, {"c": "介休市"}]
      }, {
        "c": "运城市",
        "d": [{"c": "盐湖区"}, {"c": "临猗县"}, {"c": "万荣县"}, {"c": "闻喜县"}, {"c": "稷山县"}, {"c": "新绛县"}, {"c": "绛县"}, {"c": "垣曲县"}, {"c": "夏县"}, {"c": "平陆县"}, {"c": "芮城县"}, {"c": "永济市"}, {"c": "河津市"}]
      }, {
        "c": "忻州市",
        "d": [{"c": "忻府区"}, {"c": "定襄县"}, {"c": "五台县"}, {"c": "代县"}, {"c": "繁峙县"}, {"c": "宁武县"}, {"c": "静乐县"}, {"c": "神池县"}, {"c": "五寨县"}, {"c": "岢岚县"}, {"c": "河曲县"}, {"c": "保德县"}, {"c": "偏关县"}, {"c": "原平市"}]
      }, {
        "c": "临汾市",
        "d": [{"c": "尧都区"}, {"c": "曲沃县"}, {"c": "翼城县"}, {"c": "襄汾县"}, {"c": "洪洞县"}, {"c": "古县"}, {"c": "安泽县"}, {"c": "浮山县"}, {"c": "吉县"}, {"c": "乡宁县"}, {"c": "大宁县"}, {"c": "隰县"}, {"c": "永和县"}, {"c": "蒲县"}, {"c": "汾西县"}, {"c": "侯马市"}, {"c": "霍州市"}]
      }, {
        "c": "吕梁市",
        "d": [{"c": "离石区"}, {"c": "文水县"}, {"c": "交城县"}, {"c": "兴县"}, {"c": "临县"}, {"c": "柳林县"}, {"c": "石楼县"}, {"c": "岚县"}, {"c": "方山县"}, {"c": "中阳县"}, {"c": "交口县"}, {"c": "孝义市"}, {"c": "汾阳市"}]
      }]
    }, {
      "c": "内蒙古自治区",
      "d": [{
        "c": "呼和浩特市",
        "d": [{"c": "新城区"}, {"c": "回民区"}, {"c": "玉泉区"}, {"c": "赛罕区"}, {"c": "土默特左旗"}, {"c": "托克托县"}, {"c": "和林格尔县"}, {"c": "清水河县"}, {"c": "武川县"}]
      }, {
        "c": "包头市",
        "d": [{"c": "东河区"}, {"c": "昆都仑区"}, {"c": "青山区"}, {"c": "石拐区"}, {"c": "白云鄂博矿区"}, {"c": "九原区"}, {"c": "土默特右旗"}, {"c": "固阳县"}, {"c": "达尔罕茂明安联合旗"}]
      }, {"c": "乌海市", "d": [{"c": "海勃湾区"}, {"c": "海南区"}, {"c": "乌达区"}]}, {
        "c": "赤峰市",
        "d": [{"c": "红山区"}, {"c": "元宝山区"}, {"c": "松山区"}, {"c": "阿鲁科尔沁旗"}, {"c": "巴林左旗"}, {"c": "巴林右旗"}, {"c": "林西县"}, {"c": "克什克腾旗"}, {"c": "翁牛特旗"}, {"c": "喀喇沁旗"}, {"c": "宁城县"}, {"c": "敖汉旗"}]
      }, {
        "c": "通辽市",
        "d": [{"c": "科尔沁区"}, {"c": "科尔沁左翼中旗"}, {"c": "科尔沁左翼后旗"}, {"c": "开鲁县"}, {"c": "库伦旗"}, {"c": "奈曼旗"}, {"c": "扎鲁特旗"}, {"c": "霍林郭勒市"}]
      }, {
        "c": "鄂尔多斯市",
        "d": [{"c": "东胜区"}, {"c": "康巴什区"}, {"c": "达拉特旗"}, {"c": "准格尔旗"}, {"c": "鄂托克前旗"}, {"c": "鄂托克旗"}, {"c": "杭锦旗"}, {"c": "乌审旗"}, {"c": "伊金霍洛旗"}]
      }, {
        "c": "呼伦贝尔市",
        "d": [{"c": "海拉尔区"}, {"c": "扎赉诺尔区"}, {"c": "阿荣旗"}, {"c": "莫力达瓦达斡尔族自治旗"}, {"c": "鄂伦春自治旗"}, {"c": "鄂温克族自治旗"}, {"c": "陈巴尔虎旗"}, {"c": "新巴尔虎左旗"}, {"c": "新巴尔虎右旗"}, {"c": "满洲里市"}, {"c": "牙克石市"}, {"c": "扎兰屯市"}, {"c": "额尔古纳市"}, {"c": "根河市"}]
      }, {
        "c": "巴彦淖尔市",
        "d": [{"c": "临河区"}, {"c": "五原县"}, {"c": "磴口县"}, {"c": "乌拉特前旗"}, {"c": "乌拉特中旗"}, {"c": "乌拉特后旗"}, {"c": "杭锦后旗"}]
      }, {
        "c": "乌兰察布市",
        "d": [{"c": "集宁区"}, {"c": "卓资县"}, {"c": "化德县"}, {"c": "商都县"}, {"c": "兴和县"}, {"c": "凉城县"}, {"c": "察哈尔右翼前旗"}, {"c": "察哈尔右翼中旗"}, {"c": "察哈尔右翼后旗"}, {"c": "四子王旗"}, {"c": "丰镇市"}]
      }, {
        "c": "兴安盟",
        "d": [{"c": "乌兰浩特市"}, {"c": "阿尔山市"}, {"c": "科尔沁右翼前旗"}, {"c": "科尔沁右翼中旗"}, {"c": "扎赉特旗"}, {"c": "突泉县"}]
      }, {
        "c": "锡林郭勒盟",
        "d": [{"c": "二连浩特市"}, {"c": "锡林浩特市"}, {"c": "阿巴嘎旗"}, {"c": "苏尼特左旗"}, {"c": "苏尼特右旗"}, {"c": "东乌珠穆沁旗"}, {"c": "西乌珠穆沁旗"}, {"c": "太仆寺旗"}, {"c": "镶黄旗"}, {"c": "正镶白旗"}, {"c": "正蓝旗"}, {"c": "多伦县"}]
      }, {"c": "阿拉善盟", "d": [{"c": "阿拉善左旗"}, {"c": "阿拉善右旗"}, {"c": "额济纳旗"}]}]
    }, {
      "c": "辽宁省",
      "d": [{
        "c": "沈阳市",
        "d": [{"c": "和平区"}, {"c": "沈河区"}, {"c": "大东区"}, {"c": "皇姑区"}, {"c": "铁西区"}, {"c": "苏家屯区"}, {"c": "浑南区"}, {"c": "沈北新区"}, {"c": "于洪区"}, {"c": "辽中区"}, {"c": "康平县"}, {"c": "法库县"}, {"c": "新民市"}]
      }, {
        "c": "大连市",
        "d": [{"c": "中山区"}, {"c": "西岗区"}, {"c": "沙河口区"}, {"c": "甘井子区"}, {"c": "旅顺口区"}, {"c": "金州区"}, {"c": "普兰店区"}, {"c": "长海县"}, {"c": "瓦房店市"}, {"c": "庄河市"}]
      }, {
        "c": "鞍山市",
        "d": [{"c": "铁东区"}, {"c": "铁西区"}, {"c": "立山区"}, {"c": "千山区"}, {"c": "台安县"}, {"c": "岫岩满族自治县"}, {"c": "海城市"}]
      }, {
        "c": "抚顺市",
        "d": [{"c": "新抚区"}, {"c": "东洲区"}, {"c": "望花区"}, {"c": "顺城区"}, {"c": "抚顺县"}, {"c": "新宾满族自治县"}, {"c": "清原满族自治县"}]
      }, {
        "c": "本溪市",
        "d": [{"c": "平山区"}, {"c": "溪湖区"}, {"c": "明山区"}, {"c": "南芬区"}, {"c": "本溪满族自治县"}, {"c": "桓仁满族自治县"}]
      }, {
        "c": "丹东市",
        "d": [{"c": "元宝区"}, {"c": "振兴区"}, {"c": "振安区"}, {"c": "宽甸满族自治县"}, {"c": "东港市"}, {"c": "凤城市"}]
      }, {
        "c": "锦州市",
        "d": [{"c": "古塔区"}, {"c": "凌河区"}, {"c": "太和区"}, {"c": "黑山县"}, {"c": "义县"}, {"c": "凌海市"}, {"c": "北镇市"}]
      }, {
        "c": "营口市",
        "d": [{"c": "站前区"}, {"c": "西市区"}, {"c": "鲅鱼圈区"}, {"c": "老边区"}, {"c": "盖州市"}, {"c": "大石桥市"}]
      }, {
        "c": "阜新市",
        "d": [{"c": "海州区"}, {"c": "新邱区"}, {"c": "太平区"}, {"c": "清河门区"}, {"c": "细河区"}, {"c": "阜新蒙古族自治县"}, {"c": "彰武县"}]
      }, {
        "c": "辽阳市",
        "d": [{"c": "白塔区"}, {"c": "文圣区"}, {"c": "宏伟区"}, {"c": "弓长岭区"}, {"c": "太子河区"}, {"c": "辽阳县"}, {"c": "灯塔市"}]
      }, {"c": "盘锦市", "d": [{"c": "双台子区"}, {"c": "兴隆台区"}, {"c": "大洼区"}, {"c": "盘山县"}]}, {
        "c": "铁岭市",
        "d": [{"c": "银州区"}, {"c": "清河区"}, {"c": "铁岭县"}, {"c": "西丰县"}, {"c": "昌图县"}, {"c": "调兵山市"}, {"c": "开原市"}]
      }, {
        "c": "朝阳市",
        "d": [{"c": "双塔区"}, {"c": "龙城区"}, {"c": "朝阳县"}, {"c": "建平县"}, {"c": "喀喇沁左翼蒙古族自治县"}, {"c": "北票市"}, {"c": "凌源市"}]
      }, {"c": "葫芦岛市", "d": [{"c": "连山区"}, {"c": "龙港区"}, {"c": "南票区"}, {"c": "绥中县"}, {"c": "建昌县"}, {"c": "兴城市"}]}]
    }, {
      "c": "吉林省",
      "d": [{
        "c": "长春市",
        "d": [{"c": "南关区"}, {"c": "宽城区"}, {"c": "朝阳区"}, {"c": "二道区"}, {"c": "绿园区"}, {"c": "双阳区"}, {"c": "九台区"}, {"c": "农安县"}, {"c": "榆树市"}, {"c": "德惠市"}]
      }, {
        "c": "吉林市",
        "d": [{"c": "昌邑区"}, {"c": "龙潭区"}, {"c": "船营区"}, {"c": "丰满区"}, {"c": "永吉县"}, {"c": "蛟河市"}, {"c": "桦甸市"}, {"c": "舒兰市"}, {"c": "磐石市"}]
      }, {
        "c": "四平市",
        "d": [{"c": "铁西区"}, {"c": "铁东区"}, {"c": "梨树县"}, {"c": "伊通满族自治县"}, {"c": "公主岭市"}, {"c": "双辽市"}]
      }, {"c": "辽源市", "d": [{"c": "龙山区"}, {"c": "西安区"}, {"c": "东丰县"}, {"c": "东辽县"}]}, {
        "c": "通化市",
        "d": [{"c": "东昌区"}, {"c": "二道江区"}, {"c": "通化县"}, {"c": "辉南县"}, {"c": "柳河县"}, {"c": "梅河口市"}, {"c": "集安市"}]
      }, {
        "c": "白山市",
        "d": [{"c": "浑江区"}, {"c": "江源区"}, {"c": "抚松县"}, {"c": "靖宇县"}, {"c": "长白朝鲜族自治县"}, {"c": "临江市"}]
      }, {"c": "松原市", "d": [{"c": "宁江区"}, {"c": "前郭尔罗斯蒙古族自治县"}, {"c": "长岭县"}, {"c": "乾安县"}, {"c": "扶余市"}]}, {
        "c": "白城市",
        "d": [{"c": "洮北区"}, {"c": "镇赉县"}, {"c": "通榆县"}, {"c": "洮南市"}, {"c": "大安市"}]
      }, {
        "c": "延边朝鲜族自治州",
        "d": [{"c": "延吉市"}, {"c": "图们市"}, {"c": "敦化市"}, {"c": "珲春市"}, {"c": "龙井市"}, {"c": "和龙市"}, {"c": "汪清县"}, {"c": "安图县"}]
      }]
    }, {
      "c": "黑龙江省",
      "d": [{
        "c": "哈尔滨市",
        "d": [{"c": "道里区"}, {"c": "南岗区"}, {"c": "道外区"}, {"c": "平房区"}, {"c": "松北区"}, {"c": "香坊区"}, {"c": "呼兰区"}, {"c": "阿城区"}, {"c": "双城区"}, {"c": "依兰县"}, {"c": "方正县"}, {"c": "宾县"}, {"c": "巴彦县"}, {"c": "木兰县"}, {"c": "通河县"}, {"c": "延寿县"}, {"c": "尚志市"}, {"c": "五常市"}]
      }, {
        "c": "齐齐哈尔市",
        "d": [{"c": "龙沙区"}, {"c": "建华区"}, {"c": "铁锋区"}, {"c": "昂昂溪区"}, {"c": "富拉尔基区"}, {"c": "碾子山区"}, {"c": "梅里斯达斡尔族区"}, {"c": "龙江县"}, {"c": "依安县"}, {"c": "泰来县"}, {"c": "甘南县"}, {"c": "富裕县"}, {"c": "克山县"}, {"c": "克东县"}, {"c": "拜泉县"}, {"c": "讷河市"}]
      }, {
        "c": "鸡西市",
        "d": [{"c": "鸡冠区"}, {"c": "恒山区"}, {"c": "滴道区"}, {"c": "梨树区"}, {"c": "城子河区"}, {"c": "麻山区"}, {"c": "鸡东县"}, {"c": "虎林市"}, {"c": "密山市"}]
      }, {
        "c": "鹤岗市",
        "d": [{"c": "向阳区"}, {"c": "工农区"}, {"c": "南山区"}, {"c": "兴安区"}, {"c": "东山区"}, {"c": "兴山区"}, {"c": "萝北县"}, {"c": "绥滨县"}]
      }, {
        "c": "双鸭山市",
        "d": [{"c": "尖山区"}, {"c": "岭东区"}, {"c": "四方台区"}, {"c": "宝山区"}, {"c": "集贤县"}, {"c": "友谊县"}, {"c": "宝清县"}, {"c": "饶河县"}]
      }, {
        "c": "大庆市",
        "d": [{"c": "萨尔图区"}, {"c": "龙凤区"}, {"c": "让胡路区"}, {"c": "红岗区"}, {"c": "大同区"}, {"c": "肇州县"}, {"c": "肇源县"}, {"c": "林甸县"}, {"c": "杜尔伯特蒙古族自治县"}]
      }, {
        "c": "伊春市",
        "d": [{"c": "伊春区"}, {"c": "南岔区"}, {"c": "友好区"}, {"c": "西林区"}, {"c": "翠峦区"}, {"c": "新青区"}, {"c": "美溪区"}, {"c": "金山屯区"}, {"c": "五营区"}, {"c": "乌马河区"}, {"c": "汤旺河区"}, {"c": "带岭区"}, {"c": "乌伊岭区"}, {"c": "红星区"}, {"c": "上甘岭区"}, {"c": "嘉荫县"}, {"c": "铁力市"}]
      }, {
        "c": "佳木斯市",
        "d": [{"c": "向阳区"}, {"c": "前进区"}, {"c": "东风区"}, {"c": "郊区"}, {"c": "桦南县"}, {"c": "桦川县"}, {"c": "汤原县"}, {"c": "同江市"}, {"c": "富锦市"}, {"c": "抚远市"}]
      }, {"c": "七台河市", "d": [{"c": "新兴区"}, {"c": "桃山区"}, {"c": "茄子河区"}, {"c": "勃利县"}]}, {
        "c": "牡丹江市",
        "d": [{"c": "东安区"}, {"c": "阳明区"}, {"c": "爱民区"}, {"c": "西安区"}, {"c": "林口县"}, {"c": "绥芬河市"}, {"c": "海林市"}, {"c": "宁安市"}, {"c": "穆棱市"}, {"c": "东宁市"}]
      }, {
        "c": "黑河市",
        "d": [{"c": "爱辉区"}, {"c": "嫩江县"}, {"c": "逊克县"}, {"c": "孙吴县"}, {"c": "北安市"}, {"c": "五大连池市"}]
      }, {
        "c": "绥化市",
        "d": [{"c": "北林区"}, {"c": "望奎县"}, {"c": "兰西县"}, {"c": "青冈县"}, {"c": "庆安县"}, {"c": "明水县"}, {"c": "绥棱县"}, {"c": "安达市"}, {"c": "肇东市"}, {"c": "海伦市"}]
      }, {"c": "大兴安岭地区", "d": [{"c": "呼玛县"}, {"c": "塔河县"}, {"c": "漠河县"}]}]
    }, {
      "c": "上海市",
      "d": [{"c": "黄浦区"}, {"c": "徐汇区"}, {"c": "长宁区"}, {"c": "静安区"}, {"c": "普陀区"}, {"c": "虹口区"}, {"c": "杨浦区"}, {"c": "闵行区"}, {"c": "宝山区"}, {"c": "嘉定区"}, {"c": "浦东新区"}, {"c": "金山区"}, {"c": "松江区"}, {"c": "青浦区"}, {"c": "奉贤区"}, {"c": "崇明区"}]
    }, {
      "c": "江苏省",
      "d": [{
        "c": "南京市",
        "d": [{"c": "玄武区"}, {"c": "秦淮区"}, {"c": "建邺区"}, {"c": "鼓楼区"}, {"c": "浦口区"}, {"c": "栖霞区"}, {"c": "雨花台区"}, {"c": "江宁区"}, {"c": "六合区"}, {"c": "溧水区"}, {"c": "高淳区"}]
      }, {
        "c": "无锡市",
        "d": [{"c": "锡山区"}, {"c": "惠山区"}, {"c": "滨湖区"}, {"c": "梁溪区"}, {"c": "新吴区"}, {"c": "江阴市"}, {"c": "宜兴市"}]
      }, {
        "c": "徐州市",
        "d": [{"c": "鼓楼区"}, {"c": "云龙区"}, {"c": "贾汪区"}, {"c": "泉山区"}, {"c": "铜山区"}, {"c": "丰县"}, {"c": "沛县"}, {"c": "睢宁县"}, {"c": "新沂市"}, {"c": "邳州市"}]
      }, {
        "c": "常州市",
        "d": [{"c": "天宁区"}, {"c": "钟楼区"}, {"c": "新北区"}, {"c": "武进区"}, {"c": "金坛区"}, {"c": "溧阳市"}]
      }, {
        "c": "苏州市",
        "d": [{"c": "虎丘区"}, {"c": "吴中区"}, {"c": "相城区"}, {"c": "姑苏区"}, {"c": "吴江区"}, {"c": "常熟市"}, {"c": "张家港市"}, {"c": "昆山市"}, {"c": "太仓市"}]
      }, {
        "c": "南通市",
        "d": [{"c": "崇川区"}, {"c": "港闸区"}, {"c": "通州区"}, {"c": "海安县"}, {"c": "如东县"}, {"c": "启东市"}, {"c": "如皋市"}, {"c": "海门市"}]
      }, {
        "c": "连云港市",
        "d": [{"c": "连云区"}, {"c": "海州区"}, {"c": "赣榆区"}, {"c": "东海县"}, {"c": "灌云县"}, {"c": "灌南县"}]
      }, {
        "c": "淮安市",
        "d": [{"c": "淮安区"}, {"c": "淮阴区"}, {"c": "清江浦区"}, {"c": "洪泽区"}, {"c": "涟水县"}, {"c": "盱眙县"}, {"c": "金湖县"}]
      }, {
        "c": "盐城市",
        "d": [{"c": "亭湖区"}, {"c": "盐都区"}, {"c": "大丰区"}, {"c": "响水县"}, {"c": "滨海县"}, {"c": "阜宁县"}, {"c": "射阳县"}, {"c": "建湖县"}, {"c": "东台市"}]
      }, {
        "c": "扬州市",
        "d": [{"c": "广陵区"}, {"c": "邗江区"}, {"c": "江都区"}, {"c": "宝应县"}, {"c": "仪征市"}, {"c": "高邮市"}]
      }, {
        "c": "镇江市",
        "d": [{"c": "京口区"}, {"c": "润州区"}, {"c": "丹徒区"}, {"c": "丹阳市"}, {"c": "扬中市"}, {"c": "句容市"}]
      }, {
        "c": "泰州市",
        "d": [{"c": "海陵区"}, {"c": "高港区"}, {"c": "姜堰区"}, {"c": "兴化市"}, {"c": "靖江市"}, {"c": "泰兴市"}]
      }, {"c": "宿迁市", "d": [{"c": "宿城区"}, {"c": "宿豫区"}, {"c": "沭阳县"}, {"c": "泗阳县"}, {"c": "泗洪县"}]}]
    }, {
      "c": "浙江省",
      "d": [{
        "c": "杭州市",
        "d": [{"c": "上城区"}, {"c": "下城区"}, {"c": "江干区"}, {"c": "拱墅区"}, {"c": "西湖区"}, {"c": "滨江区"}, {"c": "萧山区"}, {"c": "余杭区"}, {"c": "富阳区"}, {"c": "临安区"}, {"c": "桐庐县"}, {"c": "淳安县"}, {"c": "建德市"}]
      }, {
        "c": "宁波市",
        "d": [{"c": "海曙区"}, {"c": "江北区"}, {"c": "北仑区"}, {"c": "镇海区"}, {"c": "鄞州区"}, {"c": "奉化区"}, {"c": "象山县"}, {"c": "宁海县"}, {"c": "余姚市"}, {"c": "慈溪市"}]
      }, {
        "c": "温州市",
        "d": [{"c": "鹿城区"}, {"c": "龙湾区"}, {"c": "瓯海区"}, {"c": "洞头区"}, {"c": "永嘉县"}, {"c": "平阳县"}, {"c": "苍南县"}, {"c": "文成县"}, {"c": "泰顺县"}, {"c": "瑞安市"}, {"c": "乐清市"}]
      }, {
        "c": "嘉兴市",
        "d": [{"c": "南湖区"}, {"c": "秀洲区"}, {"c": "嘉善县"}, {"c": "海盐县"}, {"c": "海宁市"}, {"c": "平湖市"}, {"c": "桐乡市"}]
      }, {"c": "湖州市", "d": [{"c": "吴兴区"}, {"c": "南浔区"}, {"c": "德清县"}, {"c": "长兴县"}, {"c": "安吉县"}]}, {
        "c": "绍兴市",
        "d": [{"c": "越城区"}, {"c": "柯桥区"}, {"c": "上虞区"}, {"c": "新昌县"}, {"c": "诸暨市"}, {"c": "嵊州市"}]
      }, {
        "c": "金华市",
        "d": [{"c": "婺城区"}, {"c": "金东区"}, {"c": "武义县"}, {"c": "浦江县"}, {"c": "磐安县"}, {"c": "兰溪市"}, {"c": "义乌市"}, {"c": "东阳市"}, {"c": "永康市"}]
      }, {
        "c": "衢州市",
        "d": [{"c": "柯城区"}, {"c": "衢江区"}, {"c": "常山县"}, {"c": "开化县"}, {"c": "龙游县"}, {"c": "江山市"}]
      }, {"c": "舟山市", "d": [{"c": "定海区"}, {"c": "普陀区"}, {"c": "岱山县"}, {"c": "嵊泗县"}]}, {
        "c": "台州市",
        "d": [{"c": "椒江区"}, {"c": "黄岩区"}, {"c": "路桥区"}, {"c": "三门县"}, {"c": "天台县"}, {"c": "仙居县"}, {"c": "温岭市"}, {"c": "临海市"}, {"c": "玉环市"}]
      }, {
        "c": "丽水市",
        "d": [{"c": "莲都区"}, {"c": "青田县"}, {"c": "缙云县"}, {"c": "遂昌县"}, {"c": "松阳县"}, {"c": "云和县"}, {"c": "庆元县"}, {"c": "景宁畲族自治县"}, {"c": "龙泉市"}]
      }]
    }, {
      "c": "安徽省",
      "d": [{
        "c": "合肥市",
        "d": [{"c": "瑶海区"}, {"c": "庐阳区"}, {"c": "蜀山区"}, {"c": "包河区"}, {"c": "长丰县"}, {"c": "肥东县"}, {"c": "肥西县"}, {"c": "庐江县"}, {"c": "巢湖市"}]
      }, {
        "c": "芜湖市",
        "d": [{"c": "镜湖区"}, {"c": "弋江区"}, {"c": "鸠江区"}, {"c": "三山区"}, {"c": "芜湖县"}, {"c": "繁昌县"}, {"c": "南陵县"}, {"c": "无为县"}]
      }, {
        "c": "蚌埠市",
        "d": [{"c": "龙子湖区"}, {"c": "蚌山区"}, {"c": "禹会区"}, {"c": "淮上区"}, {"c": "怀远县"}, {"c": "五河县"}, {"c": "固镇县"}]
      }, {
        "c": "淮南市",
        "d": [{"c": "大通区"}, {"c": "田家庵区"}, {"c": "谢家集区"}, {"c": "八公山区"}, {"c": "潘集区"}, {"c": "凤台县"}, {"c": "寿县"}]
      }, {
        "c": "马鞍山市",
        "d": [{"c": "花山区"}, {"c": "雨山区"}, {"c": "博望区"}, {"c": "当涂县"}, {"c": "含山县"}, {"c": "和县"}]
      }, {"c": "淮北市", "d": [{"c": "杜集区"}, {"c": "相山区"}, {"c": "烈山区"}, {"c": "濉溪县"}]}, {
        "c": "铜陵市",
        "d": [{"c": "铜官区"}, {"c": "义安区"}, {"c": "郊区"}, {"c": "枞阳县"}]
      }, {
        "c": "安庆市",
        "d": [{"c": "迎江区"}, {"c": "大观区"}, {"c": "宜秀区"}, {"c": "怀宁县"}, {"c": "潜山县"}, {"c": "太湖县"}, {"c": "宿松县"}, {"c": "望江县"}, {"c": "岳西县"}, {"c": "桐城市"}]
      }, {
        "c": "黄山市",
        "d": [{"c": "屯溪区"}, {"c": "黄山区"}, {"c": "徽州区"}, {"c": "歙县"}, {"c": "休宁县"}, {"c": "黟县"}, {"c": "祁门县"}]
      }, {
        "c": "滁州市",
        "d": [{"c": "琅琊区"}, {"c": "南谯区"}, {"c": "来安县"}, {"c": "全椒县"}, {"c": "定远县"}, {"c": "凤阳县"}, {"c": "天长市"}, {"c": "明光市"}]
      }, {
        "c": "阜阳市",
        "d": [{"c": "颍州区"}, {"c": "颍东区"}, {"c": "颍泉区"}, {"c": "临泉县"}, {"c": "太和县"}, {"c": "阜南县"}, {"c": "颍上县"}, {"c": "界首市"}]
      }, {"c": "宿州市", "d": [{"c": "埇桥区"}, {"c": "砀山县"}, {"c": "萧县"}, {"c": "灵璧县"}, {"c": "泗县"}]}, {
        "c": "六安市",
        "d": [{"c": "金安区"}, {"c": "裕安区"}, {"c": "叶集区"}, {"c": "霍邱县"}, {"c": "舒城县"}, {"c": "金寨县"}, {"c": "霍山县"}]
      }, {"c": "亳州市", "d": [{"c": "谯城区"}, {"c": "涡阳县"}, {"c": "蒙城县"}, {"c": "利辛县"}]}, {
        "c": "池州市",
        "d": [{"c": "贵池区"}, {"c": "东至县"}, {"c": "石台县"}, {"c": "青阳县"}]
      }, {
        "c": "宣城市",
        "d": [{"c": "宣州区"}, {"c": "郎溪县"}, {"c": "广德县"}, {"c": "泾县"}, {"c": "绩溪县"}, {"c": "旌德县"}, {"c": "宁国市"}]
      }]
    }, {
      "c": "福建省",
      "d": [{
        "c": "福州市",
        "d": [{"c": "鼓楼区"}, {"c": "台江区"}, {"c": "仓山区"}, {"c": "马尾区"}, {"c": "晋安区"}, {"c": "长乐区"}, {"c": "闽侯县"}, {"c": "连江县"}, {"c": "罗源县"}, {"c": "闽清县"}, {"c": "永泰县"}, {"c": "平潭县"}, {"c": "福清市"}]
      }, {
        "c": "厦门市",
        "d": [{"c": "思明区"}, {"c": "海沧区"}, {"c": "湖里区"}, {"c": "集美区"}, {"c": "同安区"}, {"c": "翔安区"}]
      }, {"c": "莆田市", "d": [{"c": "城厢区"}, {"c": "涵江区"}, {"c": "荔城区"}, {"c": "秀屿区"}, {"c": "仙游县"}]}, {
        "c": "三明市",
        "d": [{"c": "梅列区"}, {"c": "三元区"}, {"c": "明溪县"}, {"c": "清流县"}, {"c": "宁化县"}, {"c": "大田县"}, {"c": "尤溪县"}, {"c": "沙县"}, {"c": "将乐县"}, {"c": "泰宁县"}, {"c": "建宁县"}, {"c": "永安市"}]
      }, {
        "c": "泉州市",
        "d": [{"c": "鲤城区"}, {"c": "丰泽区"}, {"c": "洛江区"}, {"c": "泉港区"}, {"c": "惠安县"}, {"c": "安溪县"}, {"c": "永春县"}, {"c": "德化县"}, {"c": "金门县"}, {"c": "石狮市"}, {"c": "晋江市"}, {"c": "南安市"}]
      }, {
        "c": "漳州市",
        "d": [{"c": "芗城区"}, {"c": "龙文区"}, {"c": "云霄县"}, {"c": "漳浦县"}, {"c": "诏安县"}, {"c": "长泰县"}, {"c": "东山县"}, {"c": "南靖县"}, {"c": "平和县"}, {"c": "华安县"}, {"c": "龙海市"}]
      }, {
        "c": "南平市",
        "d": [{"c": "延平区"}, {"c": "建阳区"}, {"c": "顺昌县"}, {"c": "浦城县"}, {"c": "光泽县"}, {"c": "松溪县"}, {"c": "政和县"}, {"c": "邵武市"}, {"c": "武夷山市"}, {"c": "建瓯市"}]
      }, {
        "c": "龙岩市",
        "d": [{"c": "新罗区"}, {"c": "永定区"}, {"c": "长汀县"}, {"c": "上杭县"}, {"c": "武平县"}, {"c": "连城县"}, {"c": "漳平市"}]
      }, {
        "c": "宁德市",
        "d": [{"c": "蕉城区"}, {"c": "霞浦县"}, {"c": "古田县"}, {"c": "屏南县"}, {"c": "寿宁县"}, {"c": "周宁县"}, {"c": "柘荣县"}, {"c": "福安市"}, {"c": "福鼎市"}]
      }]
    }, {
      "c": "江西省",
      "d": [{
        "c": "南昌市",
        "d": [{"c": "东湖区"}, {"c": "西湖区"}, {"c": "青云谱区"}, {"c": "湾里区"}, {"c": "青山湖区"}, {"c": "新建区"}, {"c": "红谷滩区"}, {"c": "南昌县"}, {"c": "安义县"}, {"c": "进贤县"}]
      }, {"c": "景德镇市", "d": [{"c": "昌江区"}, {"c": "珠山区"}, {"c": "浮梁县"}, {"c": "乐平市"}]}, {
        "c": "萍乡市",
        "d": [{"c": "安源区"}, {"c": "湘东区"}, {"c": "莲花县"}, {"c": "上栗县"}, {"c": "芦溪县"}]
      }, {
        "c": "九江市",
        "d": [{"c": "濂溪区"}, {"c": "浔阳区"}, {"c": "柴桑区"}, {"c": "武宁县"}, {"c": "修水县"}, {"c": "永修县"}, {"c": "德安县"}, {"c": "都昌县"}, {"c": "湖口县"}, {"c": "彭泽县"}, {"c": "瑞昌市"}, {"c": "共青城市"}, {"c": "庐山市"}]
      }, {"c": "新余市", "d": [{"c": "渝水区"}, {"c": "分宜县"}]}, {
        "c": "鹰潭市",
        "d": [{"c": "月湖区"}, {"c": "余江县"}, {"c": "贵溪市"}]
      }, {
        "c": "赣州市",
        "d": [{"c": "章贡区"}, {"c": "南康区"}, {"c": "赣县区"}, {"c": "信丰县"}, {"c": "大余县"}, {"c": "上犹县"}, {"c": "崇义县"}, {"c": "安远县"}, {"c": "龙南县"}, {"c": "定南县"}, {"c": "全南县"}, {"c": "宁都县"}, {"c": "于都县"}, {"c": "兴国县"}, {"c": "会昌县"}, {"c": "寻乌县"}, {"c": "石城县"}, {"c": "瑞金市"}]
      }, {
        "c": "吉安市",
        "d": [{"c": "吉州区"}, {"c": "青原区"}, {"c": "吉安县"}, {"c": "吉水县"}, {"c": "峡江县"}, {"c": "新干县"}, {"c": "永丰县"}, {"c": "泰和县"}, {"c": "遂川县"}, {"c": "万安县"}, {"c": "安福县"}, {"c": "永新县"}, {"c": "井冈山市"}]
      }, {
        "c": "宜春市",
        "d": [{"c": "袁州区"}, {"c": "奉新县"}, {"c": "万载县"}, {"c": "上高县"}, {"c": "宜丰县"}, {"c": "靖安县"}, {"c": "铜鼓县"}, {"c": "丰城市"}, {"c": "樟树市"}, {"c": "高安市"}]
      }, {
        "c": "抚州市",
        "d": [{"c": "临川区"}, {"c": "东乡区"}, {"c": "南城县"}, {"c": "黎川县"}, {"c": "南丰县"}, {"c": "崇仁县"}, {"c": "乐安县"}, {"c": "宜黄县"}, {"c": "金溪县"}, {"c": "资溪县"}, {"c": "广昌县"}]
      }, {
        "c": "上饶市",
        "d": [{"c": "信州区"}, {"c": "广丰区"}, {"c": "上饶县"}, {"c": "玉山县"}, {"c": "铅山县"}, {"c": "横峰县"}, {"c": "弋阳县"}, {"c": "余干县"}, {"c": "鄱阳县"}, {"c": "万年县"}, {"c": "婺源县"}, {"c": "德兴市"}]
      }]
    }, {
      "c": "山东省",
      "d": [{
        "c": "济南市",
        "d": [{"c": "历下区"}, {"c": "市中区"}, {"c": "槐荫区"}, {"c": "天桥区"}, {"c": "历城区"}, {"c": "长清区"}, {"c": "章丘区"}, {"c": "平阴县"}, {"c": "济阳县"}, {"c": "商河县"}]
      }, {
        "c": "青岛市",
        "d": [{"c": "市南区"}, {"c": "市北区"}, {"c": "黄岛区"}, {"c": "崂山区"}, {"c": "李沧区"}, {"c": "城阳区"}, {"c": "即墨区"}, {"c": "胶州市"}, {"c": "平度市"}, {"c": "莱西市"}]
      }, {
        "c": "淄博市",
        "d": [{"c": "淄川区"}, {"c": "张店区"}, {"c": "博山区"}, {"c": "临淄区"}, {"c": "周村区"}, {"c": "桓台县"}, {"c": "高青县"}, {"c": "沂源县"}]
      }, {
        "c": "枣庄市",
        "d": [{"c": "市中区"}, {"c": "薛城区"}, {"c": "峄城区"}, {"c": "台儿庄区"}, {"c": "山亭区"}, {"c": "滕州市"}]
      }, {"c": "东营市", "d": [{"c": "东营区"}, {"c": "河口区"}, {"c": "垦利区"}, {"c": "利津县"}, {"c": "广饶县"}]}, {
        "c": "烟台市",
        "d": [{"c": "芝罘区"}, {"c": "福山区"}, {"c": "牟平区"}, {"c": "莱山区"}, {"c": "长岛县"}, {"c": "龙口市"}, {"c": "莱阳市"}, {"c": "莱州市"}, {"c": "蓬莱市"}, {"c": "招远市"}, {"c": "栖霞市"}, {"c": "海阳市"}]
      }, {
        "c": "潍坊市",
        "d": [{"c": "潍城区"}, {"c": "寒亭区"}, {"c": "坊子区"}, {"c": "奎文区"}, {"c": "临朐县"}, {"c": "昌乐县"}, {"c": "青州市"}, {"c": "诸城市"}, {"c": "寿光市"}, {"c": "安丘市"}, {"c": "高密市"}, {"c": "昌邑市"}]
      }, {
        "c": "济宁市",
        "d": [{"c": "任城区"}, {"c": "兖州区"}, {"c": "微山县"}, {"c": "鱼台县"}, {"c": "金乡县"}, {"c": "嘉祥县"}, {"c": "汶上县"}, {"c": "泗水县"}, {"c": "梁山县"}, {"c": "曲阜市"}, {"c": "邹城市"}]
      }, {
        "c": "泰安市",
        "d": [{"c": "泰山区"}, {"c": "岱岳区"}, {"c": "宁阳县"}, {"c": "东平县"}, {"c": "新泰市"}, {"c": "肥城市"}]
      }, {"c": "威海市", "d": [{"c": "环翠区"}, {"c": "文登区"}, {"c": "荣成市"}, {"c": "乳山市"}]}, {
        "c": "日照市",
        "d": [{"c": "东港区"}, {"c": "岚山区"}, {"c": "五莲县"}, {"c": "莒县"}]
      }, {"c": "莱芜市", "d": [{"c": "莱城区"}, {"c": "钢城区"}]}, {
        "c": "临沂市",
        "d": [{"c": "兰山区"}, {"c": "罗庄区"}, {"c": "河东区"}, {"c": "沂南县"}, {"c": "郯城县"}, {"c": "沂水县"}, {"c": "兰陵县"}, {"c": "费县"}, {"c": "平邑县"}, {"c": "莒南县"}, {"c": "蒙阴县"}, {"c": "临沭县"}]
      }, {
        "c": "德州市",
        "d": [{"c": "德城区"}, {"c": "陵城区"}, {"c": "宁津县"}, {"c": "庆云县"}, {"c": "临邑县"}, {"c": "齐河县"}, {"c": "平原县"}, {"c": "夏津县"}, {"c": "武城县"}, {"c": "乐陵市"}, {"c": "禹城市"}]
      }, {
        "c": "聊城市",
        "d": [{"c": "东昌府区"}, {"c": "阳谷县"}, {"c": "莘县"}, {"c": "茌平县"}, {"c": "东阿县"}, {"c": "冠县"}, {"c": "高唐县"}, {"c": "临清市"}]
      }, {
        "c": "滨州市",
        "d": [{"c": "滨城区"}, {"c": "沾化区"}, {"c": "惠民县"}, {"c": "阳信县"}, {"c": "无棣县"}, {"c": "博兴县"}, {"c": "邹平县"}]
      }, {
        "c": "菏泽市",
        "d": [{"c": "牡丹区"}, {"c": "定陶区"}, {"c": "曹县"}, {"c": "单县"}, {"c": "成武县"}, {"c": "巨野县"}, {"c": "郓城县"}, {"c": "鄄城县"}, {"c": "东明县"}]
      }]
    }, {
      "c": "河南省",
      "d": [{
        "c": "郑州市",
        "d": [{"c": "中原区"}, {"c": "二七区"}, {"c": "管城回族区"}, {"c": "金水区"}, {"c": "上街区"}, {"c": "惠济区"}, {"c": "中牟县"}, {"c": "巩义市"}, {"c": "荥阳市"}, {"c": "新密市"}, {"c": "新郑市"}, {"c": "登封市"}]
      }, {
        "c": "开封市",
        "d": [{"c": "龙亭区"}, {"c": "顺河回族区"}, {"c": "鼓楼区"}, {"c": "禹王台区"}, {"c": "祥符区"}, {"c": "杞县"}, {"c": "通许县"}, {"c": "尉氏县"}, {"c": "兰考县"}]
      }, {
        "c": "洛阳市",
        "d": [{"c": "老城区"}, {"c": "西工区"}, {"c": "瀍河回族区"}, {"c": "涧西区"}, {"c": "吉利区"}, {"c": "洛龙区"}, {"c": "孟津县"}, {"c": "新安县"}, {"c": "栾川县"}, {"c": "嵩县"}, {"c": "汝阳县"}, {"c": "宜阳县"}, {"c": "洛宁县"}, {"c": "伊川县"}, {"c": "偃师市"}]
      }, {
        "c": "平顶山市",
        "d": [{"c": "新华区"}, {"c": "卫东区"}, {"c": "石龙区"}, {"c": "湛河区"}, {"c": "宝丰县"}, {"c": "叶县"}, {"c": "鲁山县"}, {"c": "郏县"}, {"c": "舞钢市"}, {"c": "汝州市"}]
      }, {
        "c": "安阳市",
        "d": [{"c": "文峰区"}, {"c": "北关区"}, {"c": "殷都区"}, {"c": "龙安区"}, {"c": "安阳县"}, {"c": "汤阴县"}, {"c": "滑县"}, {"c": "内黄县"}, {"c": "林州市"}]
      }, {"c": "鹤壁市", "d": [{"c": "鹤山区"}, {"c": "山城区"}, {"c": "淇滨区"}, {"c": "浚县"}, {"c": "淇县"}]}, {
        "c": "新乡市",
        "d": [{"c": "红旗区"}, {"c": "卫滨区"}, {"c": "凤泉区"}, {"c": "牧野区"}, {"c": "新乡县"}, {"c": "获嘉县"}, {"c": "原阳县"}, {"c": "延津县"}, {"c": "封丘县"}, {"c": "长垣县"}, {"c": "卫辉市"}, {"c": "辉县市"}]
      }, {
        "c": "焦作市",
        "d": [{"c": "解放区"}, {"c": "中站区"}, {"c": "马村区"}, {"c": "山阳区"}, {"c": "修武县"}, {"c": "博爱县"}, {"c": "武陟县"}, {"c": "温县"}, {"c": "沁阳市"}, {"c": "孟州市"}]
      }, {
        "c": "濮阳市",
        "d": [{"c": "华龙区"}, {"c": "清丰县"}, {"c": "南乐县"}, {"c": "范县"}, {"c": "台前县"}, {"c": "濮阳县"}]
      }, {
        "c": "许昌市",
        "d": [{"c": "魏都区"}, {"c": "建安区"}, {"c": "鄢陵县"}, {"c": "襄城县"}, {"c": "禹州市"}, {"c": "长葛市"}]
      }, {"c": "漯河市", "d": [{"c": "源汇区"}, {"c": "郾城区"}, {"c": "召陵区"}, {"c": "舞阳县"}, {"c": "临颍县"}]}, {
        "c": "三门峡市",
        "d": [{"c": "湖滨区"}, {"c": "陕州区"}, {"c": "渑池县"}, {"c": "卢氏县"}, {"c": "义马市"}, {"c": "灵宝市"}]
      }, {
        "c": "南阳市",
        "d": [{"c": "宛城区"}, {"c": "卧龙区"}, {"c": "南召县"}, {"c": "方城县"}, {"c": "西峡县"}, {"c": "镇平县"}, {"c": "内乡县"}, {"c": "淅川县"}, {"c": "社旗县"}, {"c": "唐河县"}, {"c": "新野县"}, {"c": "桐柏县"}, {"c": "邓州市"}]
      }, {
        "c": "商丘市",
        "d": [{"c": "梁园区"}, {"c": "睢阳区"}, {"c": "民权县"}, {"c": "睢县"}, {"c": "宁陵县"}, {"c": "柘城县"}, {"c": "虞城县"}, {"c": "夏邑县"}, {"c": "永城市"}]
      }, {
        "c": "信阳市",
        "d": [{"c": "浉河区"}, {"c": "平桥区"}, {"c": "罗山县"}, {"c": "光山县"}, {"c": "新县"}, {"c": "商城县"}, {"c": "固始县"}, {"c": "潢川县"}, {"c": "淮滨县"}, {"c": "息县"}]
      }, {
        "c": "周口市",
        "d": [{"c": "川汇区"}, {"c": "扶沟县"}, {"c": "西华县"}, {"c": "商水县"}, {"c": "沈丘县"}, {"c": "郸城县"}, {"c": "淮阳县"}, {"c": "太康县"}, {"c": "鹿邑县"}, {"c": "项城市"}]
      }, {
        "c": "驻马店市",
        "d": [{"c": "驿城区"}, {"c": "西平县"}, {"c": "上蔡县"}, {"c": "平舆县"}, {"c": "正阳县"}, {"c": "确山县"}, {"c": "泌阳县"}, {"c": "汝南县"}, {"c": "遂平县"}, {"c": "新蔡县"}]
      }, {"c": "济源市", "d": [{"c": "市辖区"}]}]
    }, {
      "c": "湖北省",
      "d": [{
        "c": "武汉市",
        "d": [{"c": "江岸区"}, {"c": "江汉区"}, {"c": "硚口区"}, {"c": "汉阳区"}, {"c": "武昌区"}, {"c": "青山区"}, {"c": "洪山区"}, {"c": "东西湖区"}, {"c": "汉南区"}, {"c": "蔡甸区"}, {"c": "江夏区"}, {"c": "黄陂区"}, {"c": "新洲区"}]
      }, {
        "c": "黄石市",
        "d": [{"c": "黄石港区"}, {"c": "西塞山区"}, {"c": "下陆区"}, {"c": "铁山区"}, {"c": "阳新县"}, {"c": "大冶市"}]
      }, {
        "c": "十堰市",
        "d": [{"c": "茅箭区"}, {"c": "张湾区"}, {"c": "郧阳区"}, {"c": "郧西县"}, {"c": "竹山县"}, {"c": "竹溪县"}, {"c": "房县"}, {"c": "丹江口市"}]
      }, {
        "c": "宜昌市",
        "d": [{"c": "西陵区"}, {"c": "伍家岗区"}, {"c": "点军区"}, {"c": "猇亭区"}, {"c": "夷陵区"}, {"c": "远安县"}, {"c": "兴山县"}, {"c": "秭归县"}, {"c": "长阳土家族自治县"}, {"c": "五峰土家族自治县"}, {"c": "宜都市"}, {"c": "当阳市"}, {"c": "枝江市"}]
      }, {
        "c": "襄阳市",
        "d": [{"c": "襄城区"}, {"c": "樊城区"}, {"c": "襄州区"}, {"c": "南漳县"}, {"c": "谷城县"}, {"c": "保康县"}, {"c": "老河口市"}, {"c": "枣阳市"}, {"c": "宜城市"}]
      }, {"c": "鄂州市", "d": [{"c": "梁子湖区"}, {"c": "华容区"}, {"c": "鄂城区"}]}, {
        "c": "荆门市",
        "d": [{"c": "东宝区"}, {"c": "掇刀区"}, {"c": "京山县"}, {"c": "沙洋县"}, {"c": "钟祥市"}]
      }, {
        "c": "孝感市",
        "d": [{"c": "孝南区"}, {"c": "孝昌县"}, {"c": "大悟县"}, {"c": "云梦县"}, {"c": "应城市"}, {"c": "安陆市"}, {"c": "汉川市"}]
      }, {
        "c": "荆州市",
        "d": [{"c": "沙市区"}, {"c": "荆州区"}, {"c": "公安县"}, {"c": "监利县"}, {"c": "江陵县"}, {"c": "石首市"}, {"c": "洪湖市"}, {"c": "松滋市"}]
      }, {
        "c": "黄冈市",
        "d": [{"c": "黄州区"}, {"c": "团风县"}, {"c": "红安县"}, {"c": "罗田县"}, {"c": "英山县"}, {"c": "浠水县"}, {"c": "蕲春县"}, {"c": "黄梅县"}, {"c": "麻城市"}, {"c": "武穴市"}]
      }, {
        "c": "咸宁市",
        "d": [{"c": "咸安区"}, {"c": "嘉鱼县"}, {"c": "通城县"}, {"c": "崇阳县"}, {"c": "通山县"}, {"c": "赤壁市"}]
      }, {"c": "随州市", "d": [{"c": "曾都区"}, {"c": "随县"}, {"c": "广水市"}]}, {
        "c": "恩施土家族苗族自治州",
        "d": [{"c": "恩施市"}, {"c": "利川市"}, {"c": "建始县"}, {"c": "巴东县"}, {"c": "宣恩县"}, {"c": "咸丰县"}, {"c": "来凤县"}, {"c": "鹤峰县"}]
      }, {"c": "仙桃市", "d": [{"c": "市辖区"}]}, {"c": "潜江市", "d": [{"c": "市辖区"}]}, {
        "c": "天门市",
        "d": [{"c": "市辖区"}]
      }, {"c": "神农架林区", "d": [{"c": "区辖区"}]}]
    }, {
      "c": "湖南省",
      "d": [{
        "c": "长沙市",
        "d": [{"c": "芙蓉区"}, {"c": "天心区"}, {"c": "岳麓区"}, {"c": "开福区"}, {"c": "雨花区"}, {"c": "望城区"}, {"c": "长沙县"}, {"c": "浏阳市"}, {"c": "宁乡市"}]
      }, {
        "c": "株洲市",
        "d": [{"c": "荷塘区"}, {"c": "芦淞区"}, {"c": "石峰区"}, {"c": "天元区"}, {"c": "株洲县"}, {"c": "攸县"}, {"c": "茶陵县"}, {"c": "炎陵县"}, {"c": "醴陵市"}]
      }, {"c": "湘潭市", "d": [{"c": "雨湖区"}, {"c": "岳塘区"}, {"c": "湘潭县"}, {"c": "湘乡市"}, {"c": "韶山市"}]}, {
        "c": "衡阳市",
        "d": [{"c": "珠晖区"}, {"c": "雁峰区"}, {"c": "石鼓区"}, {"c": "蒸湘区"}, {"c": "南岳区"}, {"c": "衡阳县"}, {"c": "衡南县"}, {"c": "衡山县"}, {"c": "衡东县"}, {"c": "祁东县"}, {"c": "耒阳市"}, {"c": "常宁市"}]
      }, {
        "c": "邵阳市",
        "d": [{"c": "双清区"}, {"c": "大祥区"}, {"c": "北塔区"}, {"c": "邵东县"}, {"c": "新邵县"}, {"c": "邵阳县"}, {"c": "隆回县"}, {"c": "洞口县"}, {"c": "绥宁县"}, {"c": "新宁县"}, {"c": "城步苗族自治县"}, {"c": "武冈市"}]
      }, {
        "c": "岳阳市",
        "d": [{"c": "岳阳楼区"}, {"c": "云溪区"}, {"c": "君山区"}, {"c": "岳阳县"}, {"c": "华容县"}, {"c": "湘阴县"}, {"c": "平江县"}, {"c": "汨罗市"}, {"c": "临湘市"}]
      }, {
        "c": "常德市",
        "d": [{"c": "武陵区"}, {"c": "鼎城区"}, {"c": "安乡县"}, {"c": "汉寿县"}, {"c": "澧县"}, {"c": "临澧县"}, {"c": "桃源县"}, {"c": "石门县"}, {"c": "津市市"}]
      }, {"c": "张家界市", "d": [{"c": "永定区"}, {"c": "武陵源区"}, {"c": "慈利县"}, {"c": "桑植县"}]}, {
        "c": "益阳市",
        "d": [{"c": "资阳区"}, {"c": "赫山区"}, {"c": "南县"}, {"c": "桃江县"}, {"c": "安化县"}, {"c": "沅江市"}]
      }, {
        "c": "郴州市",
        "d": [{"c": "北湖区"}, {"c": "苏仙区"}, {"c": "桂阳县"}, {"c": "宜章县"}, {"c": "永兴县"}, {"c": "嘉禾县"}, {"c": "临武县"}, {"c": "汝城县"}, {"c": "桂东县"}, {"c": "安仁县"}, {"c": "资兴市"}]
      }, {
        "c": "永州市",
        "d": [{"c": "零陵区"}, {"c": "冷水滩区"}, {"c": "祁阳县"}, {"c": "东安县"}, {"c": "双牌县"}, {"c": "道县"}, {"c": "江永县"}, {"c": "宁远县"}, {"c": "蓝山县"}, {"c": "新田县"}, {"c": "江华瑶族自治县"}]
      }, {
        "c": "怀化市",
        "d": [{"c": "鹤城区"}, {"c": "中方县"}, {"c": "沅陵县"}, {"c": "辰溪县"}, {"c": "溆浦县"}, {"c": "会同县"}, {"c": "麻阳苗族自治县"}, {"c": "新晃侗族自治县"}, {"c": "芷江侗族自治县"}, {"c": "靖州苗族侗族自治县"}, {"c": "通道侗族自治县"}, {"c": "洪江市"}]
      }, {"c": "娄底市", "d": [{"c": "娄星区"}, {"c": "双峰县"}, {"c": "新化县"}, {"c": "冷水江市"}, {"c": "涟源市"}]}, {
        "c": "湘西土家族苗族自治州",
        "d": [{"c": "吉首市"}, {"c": "泸溪县"}, {"c": "凤凰县"}, {"c": "花垣县"}, {"c": "保靖县"}, {"c": "古丈县"}, {"c": "永顺县"}, {"c": "龙山县"}]
      }]
    }, {
      "c": "广东省",
      "d": [{
        "c": "广州市",
        "d": [{"c": "荔湾区"}, {"c": "越秀区"}, {"c": "海珠区"}, {"c": "天河区"}, {"c": "白云区"}, {"c": "黄埔区"}, {"c": "番禺区"}, {"c": "花都区"}, {"c": "南沙区"}, {"c": "从化区"}, {"c": "增城区"}]
      }, {
        "c": "韶关市",
        "d": [{"c": "武江区"}, {"c": "浈江区"}, {"c": "曲江区"}, {"c": "始兴县"}, {"c": "仁化县"}, {"c": "翁源县"}, {"c": "乳源瑶族自治县"}, {"c": "新丰县"}, {"c": "乐昌市"}, {"c": "南雄市"}]
      }, {
        "c": "深圳市",
        "d": [{"c": "罗湖区"}, {"c": "福田区"}, {"c": "南山区"}, {"c": "宝安区"}, {"c": "龙岗区"}, {"c": "盐田区"}, {"c": "龙华区"}, {"c": "坪山区"}]
      }, {"c": "珠海市", "d": [{"c": "香洲区"}, {"c": "斗门区"}, {"c": "金湾区"}]}, {
        "c": "汕头市",
        "d": [{"c": "龙湖区"}, {"c": "金平区"}, {"c": "濠江区"}, {"c": "潮阳区"}, {"c": "潮南区"}, {"c": "澄海区"}, {"c": "南澳县"}]
      }, {"c": "佛山市", "d": [{"c": "禅城区"}, {"c": "南海区"}, {"c": "顺德区"}, {"c": "三水区"}, {"c": "高明区"}]}, {
        "c": "江门市",
        "d": [{"c": "蓬江区"}, {"c": "江海区"}, {"c": "新会区"}, {"c": "台山市"}, {"c": "开平市"}, {"c": "鹤山市"}, {"c": "恩平市"}]
      }, {
        "c": "湛江市",
        "d": [{"c": "赤坎区"}, {"c": "霞山区"}, {"c": "坡头区"}, {"c": "麻章区"}, {"c": "遂溪县"}, {"c": "徐闻县"}, {"c": "廉江市"}, {"c": "雷州市"}, {"c": "吴川市"}]
      }, {"c": "茂名市", "d": [{"c": "茂南区"}, {"c": "电白区"}, {"c": "高州市"}, {"c": "化州市"}, {"c": "信宜市"}]}, {
        "c": "肇庆市",
        "d": [{"c": "端州区"}, {"c": "鼎湖区"}, {"c": "高要区"}, {"c": "广宁县"}, {"c": "怀集县"}, {"c": "封开县"}, {"c": "德庆县"}, {"c": "四会市"}]
      }, {"c": "惠州市", "d": [{"c": "惠城区"}, {"c": "惠阳区"}, {"c": "博罗县"}, {"c": "惠东县"}, {"c": "龙门县"}]}, {
        "c": "梅州市",
        "d": [{"c": "梅江区"}, {"c": "梅县区"}, {"c": "大埔县"}, {"c": "丰顺县"}, {"c": "五华县"}, {"c": "平远县"}, {"c": "蕉岭县"}, {"c": "兴宁市"}]
      }, {"c": "汕尾市", "d": [{"c": "城区"}, {"c": "海丰县"}, {"c": "陆河县"}, {"c": "陆丰市"}]}, {
        "c": "河源市",
        "d": [{"c": "源城区"}, {"c": "紫金县"}, {"c": "龙川县"}, {"c": "连平县"}, {"c": "和平县"}, {"c": "东源县"}]
      }, {"c": "阳江市", "d": [{"c": "江城区"}, {"c": "阳东区"}, {"c": "阳西县"}, {"c": "阳春市"}]}, {
        "c": "清远市",
        "d": [{"c": "清城区"}, {"c": "清新区"}, {"c": "佛冈县"}, {"c": "阳山县"}, {"c": "连山壮族瑶族自治县"}, {"c": "连南瑶族自治县"}, {"c": "英德市"}, {"c": "连州市"}]
      }, {"c": "东莞市", "d": [{"c": "市辖区"}]}, {"c": "中山市", "d": [{"c": "市辖区"}]}, {
        "c": "潮州市",
        "d": [{"c": "湘桥区"}, {"c": "潮安区"}, {"c": "饶平县"}]
      }, {"c": "揭阳市", "d": [{"c": "榕城区"}, {"c": "揭东区"}, {"c": "揭西县"}, {"c": "惠来县"}, {"c": "普宁市"}]}, {
        "c": "云浮市",
        "d": [{"c": "云城区"}, {"c": "云安区"}, {"c": "新兴县"}, {"c": "郁南县"}, {"c": "罗定市"}]
      }]
    }, {
      "c": "广西壮族自治区",
      "d": [{
        "c": "南宁市",
        "d": [{"c": "兴宁区"}, {"c": "青秀区"}, {"c": "江南区"}, {"c": "西乡塘区"}, {"c": "良庆区"}, {"c": "邕宁区"}, {"c": "武鸣区"}, {"c": "隆安县"}, {"c": "马山县"}, {"c": "上林县"}, {"c": "宾阳县"}, {"c": "横县"}]
      }, {
        "c": "柳州市",
        "d": [{"c": "城中区"}, {"c": "鱼峰区"}, {"c": "柳南区"}, {"c": "柳北区"}, {"c": "柳江区"}, {"c": "柳城县"}, {"c": "鹿寨县"}, {"c": "融安县"}, {"c": "融水苗族自治县"}, {"c": "三江侗族自治县"}]
      }, {
        "c": "桂林市",
        "d": [{"c": "秀峰区"}, {"c": "叠彩区"}, {"c": "象山区"}, {"c": "七星区"}, {"c": "雁山区"}, {"c": "临桂区"}, {"c": "阳朔县"}, {"c": "灵川县"}, {"c": "全州县"}, {"c": "兴安县"}, {"c": "永福县"}, {"c": "灌阳县"}, {"c": "龙胜各族自治县"}, {"c": "资源县"}, {"c": "平乐县"}, {"c": "荔浦县"}, {"c": "恭城瑶族自治县"}]
      }, {
        "c": "梧州市",
        "d": [{"c": "万秀区"}, {"c": "长洲区"}, {"c": "龙圩区"}, {"c": "苍梧县"}, {"c": "藤县"}, {"c": "蒙山县"}, {"c": "岑溪市"}]
      }, {"c": "北海市", "d": [{"c": "海城区"}, {"c": "银海区"}, {"c": "铁山港区"}, {"c": "合浦县"}]}, {
        "c": "防城港市",
        "d": [{"c": "港口区"}, {"c": "防城区"}, {"c": "上思县"}, {"c": "东兴市"}]
      }, {"c": "钦州市", "d": [{"c": "钦南区"}, {"c": "钦北区"}, {"c": "灵山县"}, {"c": "浦北县"}]}, {
        "c": "贵港市",
        "d": [{"c": "港北区"}, {"c": "港南区"}, {"c": "覃塘区"}, {"c": "平南县"}, {"c": "桂平市"}]
      }, {
        "c": "玉林市",
        "d": [{"c": "玉州区"}, {"c": "福绵区"}, {"c": "容县"}, {"c": "陆川县"}, {"c": "博白县"}, {"c": "兴业县"}, {"c": "北流市"}]
      }, {
        "c": "百色市",
        "d": [{"c": "右江区"}, {"c": "田阳县"}, {"c": "田东县"}, {"c": "平果县"}, {"c": "德保县"}, {"c": "那坡县"}, {"c": "凌云县"}, {"c": "乐业县"}, {"c": "田林县"}, {"c": "西林县"}, {"c": "隆林各族自治县"}, {"c": "靖西市"}]
      }, {"c": "贺州市", "d": [{"c": "八步区"}, {"c": "平桂区"}, {"c": "昭平县"}, {"c": "钟山县"}, {"c": "富川瑶族自治县"}]}, {
        "c": "河池市",
        "d": [{"c": "金城江区"}, {"c": "宜州区"}, {"c": "南丹县"}, {"c": "天峨县"}, {"c": "凤山县"}, {"c": "东兰县"}, {"c": "罗城仫佬族自治县"}, {"c": "环江毛南族自治县"}, {"c": "巴马瑶族自治县"}, {"c": "都安瑶族自治县"}, {"c": "大化瑶族自治县"}]
      }, {
        "c": "来宾市",
        "d": [{"c": "兴宾区"}, {"c": "忻城县"}, {"c": "象州县"}, {"c": "武宣县"}, {"c": "金秀瑶族自治县"}, {"c": "合山市"}]
      }, {
        "c": "崇左市",
        "d": [{"c": "江州区"}, {"c": "扶绥县"}, {"c": "宁明县"}, {"c": "龙州县"}, {"c": "大新县"}, {"c": "天等县"}, {"c": "凭祥市"}]
      }]
    }, {
      "c": "海南省",
      "d": [{"c": "海口市", "d": [{"c": "秀英区"}, {"c": "龙华区"}, {"c": "琼山区"}, {"c": "美兰区"}]}, {
        "c": "三亚市",
        "d": [{"c": "海棠区"}, {"c": "吉阳区"}, {"c": "天涯区"}, {"c": "崖州区"}]
      }, {"c": "三沙市", "d": [{"c": "市辖区"}]}, {"c": "儋州市", "d": [{"c": "市辖区"}]}, {
        "c": "五指山市",
        "d": [{"c": "市辖区"}]
      }, {"c": "琼海市", "d": [{"c": "市辖区"}]}, {"c": "文昌市", "d": [{"c": "市辖区"}]}, {
        "c": "万宁市",
        "d": [{"c": "市辖区"}]
      }, {"c": "东方市", "d": [{"c": "市辖区"}]}, {"c": "定安县", "d": [{"c": "县辖区"}]}, {
        "c": "屯昌县",
        "d": [{"c": "县辖区"}]
      }, {"c": "澄迈县", "d": [{"c": "县辖区"}]}, {"c": "临高县", "d": [{"c": "县辖区"}]}, {
        "c": "白沙黎族自治县",
        "d": [{"c": "县辖区"}]
      }, {"c": "昌江黎族自治县", "d": [{"c": "县辖区"}]}, {"c": "乐东黎族自治县", "d": [{"c": "县辖区"}]}, {
        "c": "陵水黎族自治县",
        "d": [{"c": "县辖区"}]
      }, {"c": "保亭黎族苗族自治县", "d": [{"c": "县辖区"}]}, {"c": "琼中黎族苗族自治县", "d": [{"c": "县辖区"}]}]
    }, {
      "c": "重庆市",
      "d": [{"c": "万州区"}, {"c": "涪陵区"}, {"c": "渝中区"}, {"c": "大渡口区"}, {"c": "江北区"}, {"c": "沙坪坝区"}, {"c": "九龙坡区"}, {"c": "南岸区"}, {"c": "北碚区"}, {"c": "綦江区"}, {"c": "大足区"}, {"c": "渝北区"}, {"c": "巴南区"}, {"c": "黔江区"}, {"c": "长寿区"}, {"c": "江津区"}, {"c": "合川区"}, {"c": "永川区"}, {"c": "南川区"}, {"c": "璧山区"}, {"c": "铜梁区"}, {"c": "潼南区"}, {"c": "荣昌区"}, {"c": "开州区"}, {"c": "梁平区"}, {"c": "武隆区"}, {"c": "城口县"}, {"c": "丰都县"}, {"c": "垫江县"}, {"c": "忠县"}, {"c": "云阳县"}, {"c": "奉节县"}, {"c": "巫山县"}, {"c": "巫溪县"}, {"c": "石柱土家族自治县"}, {"c": "秀山土家族苗族自治县"}, {"c": "酉阳土家族苗族自治县"}, {"c": "彭水苗族土家族自治县"}]
    }, {
      "c": "四川省",
      "d": [{
        "c": "成都市",
        "d": [{"c": "锦江区"}, {"c": "青羊区"}, {"c": "金牛区"}, {"c": "武侯区"}, {"c": "成华区"}, {"c": "龙泉驿区"}, {"c": "青白江区"}, {"c": "新都区"}, {"c": "温江区"}, {"c": "双流区"}, {"c": "郫都区"}, {"c": "金堂县"}, {"c": "大邑县"}, {"c": "蒲江县"}, {"c": "新津县"}, {"c": "都江堰市"}, {"c": "彭州市"}, {"c": "邛崃市"}, {"c": "崇州市"}, {"c": "简阳市"}]
      }, {
        "c": "自贡市",
        "d": [{"c": "自流井区"}, {"c": "贡井区"}, {"c": "大安区"}, {"c": "沿滩区"}, {"c": "荣县"}, {"c": "富顺县"}]
      }, {"c": "攀枝花市", "d": [{"c": "东区"}, {"c": "西区"}, {"c": "仁和区"}, {"c": "米易县"}, {"c": "盐边县"}]}, {
        "c": "泸州市",
        "d": [{"c": "江阳区"}, {"c": "纳溪区"}, {"c": "龙马潭区"}, {"c": "泸县"}, {"c": "合江县"}, {"c": "叙永县"}, {"c": "古蔺县"}]
      }, {
        "c": "德阳市",
        "d": [{"c": "旌阳区"}, {"c": "罗江区"}, {"c": "中江县"}, {"c": "广汉市"}, {"c": "什邡市"}, {"c": "绵竹市"}]
      }, {
        "c": "绵阳市",
        "d": [{"c": "涪城区"}, {"c": "游仙区"}, {"c": "安州区"}, {"c": "三台县"}, {"c": "盐亭县"}, {"c": "梓潼县"}, {"c": "北川羌族自治县"}, {"c": "平武县"}, {"c": "江油市"}]
      }, {
        "c": "广元市",
        "d": [{"c": "利州区"}, {"c": "昭化区"}, {"c": "朝天区"}, {"c": "旺苍县"}, {"c": "青川县"}, {"c": "剑阁县"}, {"c": "苍溪县"}]
      }, {"c": "遂宁市", "d": [{"c": "船山区"}, {"c": "安居区"}, {"c": "蓬溪县"}, {"c": "射洪县"}, {"c": "大英县"}]}, {
        "c": "内江市",
        "d": [{"c": "市中区"}, {"c": "东兴区"}, {"c": "威远县"}, {"c": "资中县"}, {"c": "隆昌市"}]
      }, {
        "c": "乐山市",
        "d": [{"c": "市中区"}, {"c": "沙湾区"}, {"c": "五通桥区"}, {"c": "金口河区"}, {"c": "犍为县"}, {"c": "井研县"}, {"c": "夹江县"}, {"c": "沐川县"}, {"c": "峨边彝族自治县"}, {"c": "马边彝族自治县"}, {"c": "峨眉山市"}]
      }, {
        "c": "南充市",
        "d": [{"c": "顺庆区"}, {"c": "高坪区"}, {"c": "嘉陵区"}, {"c": "南部县"}, {"c": "营山县"}, {"c": "蓬安县"}, {"c": "仪陇县"}, {"c": "西充县"}, {"c": "阆中市"}]
      }, {
        "c": "眉山市",
        "d": [{"c": "东坡区"}, {"c": "彭山区"}, {"c": "仁寿县"}, {"c": "洪雅县"}, {"c": "丹棱县"}, {"c": "青神县"}]
      }, {
        "c": "宜宾市",
        "d": [{"c": "翠屏区"}, {"c": "南溪区"}, {"c": "宜宾县"}, {"c": "江安县"}, {"c": "长宁县"}, {"c": "高县"}, {"c": "珙县"}, {"c": "筠连县"}, {"c": "兴文县"}, {"c": "屏山县"}]
      }, {
        "c": "广安市",
        "d": [{"c": "广安区"}, {"c": "前锋区"}, {"c": "岳池县"}, {"c": "武胜县"}, {"c": "邻水县"}, {"c": "华蓥市"}]
      }, {
        "c": "达州市",
        "d": [{"c": "通川区"}, {"c": "达川区"}, {"c": "宣汉县"}, {"c": "开江县"}, {"c": "大竹县"}, {"c": "渠县"}, {"c": "万源市"}]
      }, {
        "c": "雅安市",
        "d": [{"c": "雨城区"}, {"c": "名山区"}, {"c": "荥经县"}, {"c": "汉源县"}, {"c": "石棉县"}, {"c": "天全县"}, {"c": "芦山县"}, {"c": "宝兴县"}]
      }, {"c": "巴中市", "d": [{"c": "巴州区"}, {"c": "恩阳区"}, {"c": "通江县"}, {"c": "南江县"}, {"c": "平昌县"}]}, {
        "c": "资阳市",
        "d": [{"c": "雁江区"}, {"c": "安岳县"}, {"c": "乐至县"}]
      }, {
        "c": "阿坝藏族羌族自治州",
        "d": [{"c": "马尔康市"}, {"c": "汶川县"}, {"c": "理县"}, {"c": "茂县"}, {"c": "松潘县"}, {"c": "九寨沟县"}, {"c": "金川县"}, {"c": "小金县"}, {"c": "黑水县"}, {"c": "壤塘县"}, {"c": "阿坝县"}, {"c": "若尔盖县"}, {"c": "红原县"}]
      }, {
        "c": "甘孜藏族自治州",
        "d": [{"c": "康定市"}, {"c": "泸定县"}, {"c": "丹巴县"}, {"c": "九龙县"}, {"c": "雅江县"}, {"c": "道孚县"}, {"c": "炉霍县"}, {"c": "甘孜县"}, {"c": "新龙县"}, {"c": "德格县"}, {"c": "白玉县"}, {"c": "石渠县"}, {"c": "色达县"}, {"c": "理塘县"}, {"c": "巴塘县"}, {"c": "乡城县"}, {"c": "稻城县"}, {"c": "得荣县"}]
      }, {
        "c": "凉山彝族自治州",
        "d": [{"c": "西昌市"}, {"c": "木里藏族自治县"}, {"c": "盐源县"}, {"c": "德昌县"}, {"c": "会理县"}, {"c": "会东县"}, {"c": "宁南县"}, {"c": "普格县"}, {"c": "布拖县"}, {"c": "金阳县"}, {"c": "昭觉县"}, {"c": "喜德县"}, {"c": "冕宁县"}, {"c": "越西县"}, {"c": "甘洛县"}, {"c": "美姑县"}, {"c": "雷波县"}]
      }]
    }, {
      "c": "贵州省",
      "d": [{
        "c": "贵阳市",
        "d": [{"c": "南明区"}, {"c": "云岩区"}, {"c": "花溪区"}, {"c": "乌当区"}, {"c": "白云区"}, {"c": "观山湖区"}, {"c": "开阳县"}, {"c": "息烽县"}, {"c": "修文县"}, {"c": "清镇市"}]
      }, {"c": "六盘水市", "d": [{"c": "钟山区"}, {"c": "六枝特区"}, {"c": "水城县"}, {"c": "盘州市"}]}, {
        "c": "遵义市",
        "d": [{"c": "红花岗区"}, {"c": "汇川区"}, {"c": "播州区"}, {"c": "桐梓县"}, {"c": "绥阳县"}, {"c": "正安县"}, {"c": "道真仡佬族苗族自治县"}, {"c": "务川仡佬族苗族自治县"}, {"c": "凤冈县"}, {"c": "湄潭县"}, {"c": "余庆县"}, {"c": "习水县"}, {"c": "赤水市"}, {"c": "仁怀市"}]
      }, {
        "c": "安顺市",
        "d": [{"c": "西秀区"}, {"c": "平坝区"}, {"c": "普定县"}, {"c": "镇宁布依族苗族自治县"}, {"c": "关岭布依族苗族自治县"}, {"c": "紫云苗族布依族自治县"}]
      }, {
        "c": "毕节市",
        "d": [{"c": "七星关区"}, {"c": "大方县"}, {"c": "黔西县"}, {"c": "金沙县"}, {"c": "织金县"}, {"c": "纳雍县"}, {"c": "威宁彝族回族苗族自治县"}, {"c": "赫章县"}]
      }, {
        "c": "铜仁市",
        "d": [{"c": "碧江区"}, {"c": "万山区"}, {"c": "江口县"}, {"c": "玉屏侗族自治县"}, {"c": "石阡县"}, {"c": "思南县"}, {"c": "印江土家族苗族自治县"}, {"c": "德江县"}, {"c": "沿河土家族自治县"}, {"c": "松桃苗族自治县"}]
      }, {
        "c": "黔西南布依族苗族自治州",
        "d": [{"c": "兴义市"}, {"c": "兴仁县"}, {"c": "普安县"}, {"c": "晴隆县"}, {"c": "贞丰县"}, {"c": "望谟县"}, {"c": "册亨县"}, {"c": "安龙县"}]
      }, {
        "c": "黔东南苗族侗族自治州",
        "d": [{"c": "凯里市"}, {"c": "黄平县"}, {"c": "施秉县"}, {"c": "三穗县"}, {"c": "镇远县"}, {"c": "岑巩县"}, {"c": "天柱县"}, {"c": "锦屏县"}, {"c": "剑河县"}, {"c": "台江县"}, {"c": "黎平县"}, {"c": "榕江县"}, {"c": "从江县"}, {"c": "雷山县"}, {"c": "麻江县"}, {"c": "丹寨县"}]
      }, {
        "c": "黔南布依族苗族自治州",
        "d": [{"c": "都匀市"}, {"c": "福泉市"}, {"c": "荔波县"}, {"c": "贵定县"}, {"c": "瓮安县"}, {"c": "独山县"}, {"c": "平塘县"}, {"c": "罗甸县"}, {"c": "长顺县"}, {"c": "龙里县"}, {"c": "惠水县"}, {"c": "三都水族自治县"}]
      }]
    }, {
      "c": "云南省",
      "d": [{
        "c": "昆明市",
        "d": [{"c": "五华区"}, {"c": "盘龙区"}, {"c": "官渡区"}, {"c": "西山区"}, {"c": "东川区"}, {"c": "呈贡区"}, {"c": "晋宁区"}, {"c": "富民县"}, {"c": "宜良县"}, {"c": "石林彝族自治县"}, {"c": "嵩明县"}, {"c": "禄劝彝族苗族自治县"}, {"c": "寻甸回族彝族自治县"}, {"c": "安宁市"}]
      }, {
        "c": "曲靖市",
        "d": [{"c": "麒麟区"}, {"c": "沾益区"}, {"c": "马龙县"}, {"c": "陆良县"}, {"c": "师宗县"}, {"c": "罗平县"}, {"c": "富源县"}, {"c": "会泽县"}, {"c": "宣威市"}]
      }, {
        "c": "玉溪市",
        "d": [{"c": "红塔区"}, {"c": "江川区"}, {"c": "澄江县"}, {"c": "通海县"}, {"c": "华宁县"}, {"c": "易门县"}, {"c": "峨山彝族自治县"}, {"c": "新平彝族傣族自治县"}, {"c": "元江哈尼族彝族傣族自治县"}]
      }, {"c": "保山市", "d": [{"c": "隆阳区"}, {"c": "施甸县"}, {"c": "龙陵县"}, {"c": "昌宁县"}, {"c": "腾冲市"}]}, {
        "c": "昭通市",
        "d": [{"c": "昭阳区"}, {"c": "鲁甸县"}, {"c": "巧家县"}, {"c": "盐津县"}, {"c": "大关县"}, {"c": "永善县"}, {"c": "绥江县"}, {"c": "镇雄县"}, {"c": "彝良县"}, {"c": "威信县"}, {"c": "水富县"}]
      }, {
        "c": "丽江市",
        "d": [{"c": "古城区"}, {"c": "玉龙纳西族自治县"}, {"c": "永胜县"}, {"c": "华坪县"}, {"c": "宁蒗彝族自治县"}]
      }, {
        "c": "普洱市",
        "d": [{"c": "思茅区"}, {"c": "宁洱哈尼族彝族自治县"}, {"c": "墨江哈尼族自治县"}, {"c": "景东彝族自治县"}, {"c": "景谷傣族彝族自治县"}, {"c": "镇沅彝族哈尼族拉祜族自治县"}, {"c": "江城哈尼族彝族自治县"}, {"c": "孟连傣族拉祜族佤族自治县"}, {"c": "澜沧拉祜族自治县"}, {"c": "西盟佤族自治县"}]
      }, {
        "c": "临沧市",
        "d": [{"c": "临翔区"}, {"c": "凤庆县"}, {"c": "云县"}, {"c": "永德县"}, {"c": "镇康县"}, {"c": "双江拉祜族佤族布朗族傣族自治县"}, {"c": "耿马傣族佤族自治县"}, {"c": "沧源佤族自治县"}]
      }, {
        "c": "楚雄彝族自治州",
        "d": [{"c": "楚雄市"}, {"c": "双柏县"}, {"c": "牟定县"}, {"c": "南华县"}, {"c": "姚安县"}, {"c": "大姚县"}, {"c": "永仁县"}, {"c": "元谋县"}, {"c": "武定县"}, {"c": "禄丰县"}]
      }, {
        "c": "红河哈尼族彝族自治州",
        "d": [{"c": "个旧市"}, {"c": "开远市"}, {"c": "蒙自市"}, {"c": "弥勒市"}, {"c": "屏边苗族自治县"}, {"c": "建水县"}, {"c": "石屏县"}, {"c": "泸西县"}, {"c": "元阳县"}, {"c": "红河县"}, {"c": "金平苗族瑶族傣族自治县"}, {"c": "绿春县"}, {"c": "河口瑶族自治县"}]
      }, {
        "c": "文山壮族苗族自治州",
        "d": [{"c": "文山市"}, {"c": "砚山县"}, {"c": "西畴县"}, {"c": "麻栗坡县"}, {"c": "马关县"}, {"c": "丘北县"}, {"c": "广南县"}, {"c": "富宁县"}]
      }, {"c": "西双版纳傣族自治州", "d": [{"c": "景洪市"}, {"c": "勐海县"}, {"c": "勐腊县"}]}, {
        "c": "大理白族自治州",
        "d": [{"c": "大理市"}, {"c": "漾濞彝族自治县"}, {"c": "祥云县"}, {"c": "宾川县"}, {"c": "弥渡县"}, {"c": "南涧彝族自治县"}, {"c": "巍山彝族回族自治县"}, {"c": "永平县"}, {"c": "云龙县"}, {"c": "洱源县"}, {"c": "剑川县"}, {"c": "鹤庆县"}]
      }, {
        "c": "德宏傣族景颇族自治州",
        "d": [{"c": "瑞丽市"}, {"c": "芒市"}, {"c": "梁河县"}, {"c": "盈江县"}, {"c": "陇川县"}]
      }, {
        "c": "怒江傈僳族自治州",
        "d": [{"c": "泸水市"}, {"c": "福贡县"}, {"c": "贡山独龙族怒族自治县"}, {"c": "兰坪白族普米族自治县"}]
      }, {"c": "迪庆藏族自治州", "d": [{"c": "香格里拉市"}, {"c": "德钦县"}, {"c": "维西傈僳族自治县"}]}]
    }, {
      "c": "西藏自治区",
      "d": [{
        "c": "拉萨市",
        "d": [{"c": "城关区"}, {"c": "堆龙德庆区"}, {"c": "达孜区"}, {"c": "林周县"}, {"c": "当雄县"}, {"c": "尼木县"}, {"c": "曲水县"}, {"c": "墨竹工卡县"}]
      }, {
        "c": "日喀则市",
        "d": [{"c": "桑珠孜区"}, {"c": "南木林县"}, {"c": "江孜县"}, {"c": "定日县"}, {"c": "萨迦县"}, {"c": "拉孜县"}, {"c": "昂仁县"}, {"c": "谢通门县"}, {"c": "白朗县"}, {"c": "仁布县"}, {"c": "康马县"}, {"c": "定结县"}, {"c": "仲巴县"}, {"c": "亚东县"}, {"c": "吉隆县"}, {"c": "聂拉木县"}, {"c": "萨嘎县"}, {"c": "岗巴县"}]
      }, {
        "c": "昌都市",
        "d": [{"c": "卡若区"}, {"c": "江达县"}, {"c": "贡觉县"}, {"c": "类乌齐县"}, {"c": "丁青县"}, {"c": "察雅县"}, {"c": "八宿县"}, {"c": "左贡县"}, {"c": "芒康县"}, {"c": "洛隆县"}, {"c": "边坝县"}]
      }, {
        "c": "林芝市",
        "d": [{"c": "巴宜区"}, {"c": "工布江达县"}, {"c": "米林县"}, {"c": "墨脱县"}, {"c": "波密县"}, {"c": "察隅县"}, {"c": "朗县"}]
      }, {
        "c": "山南市",
        "d": [{"c": "乃东区"}, {"c": "扎囊县"}, {"c": "贡嘎县"}, {"c": "桑日县"}, {"c": "琼结县"}, {"c": "曲松县"}, {"c": "措美县"}, {"c": "洛扎县"}, {"c": "加查县"}, {"c": "隆子县"}, {"c": "错那县"}, {"c": "浪卡子县"}]
      }, {
        "c": "那曲市",
        "d": [{"c": "色尼区"}, {"c": "嘉黎县"}, {"c": "比如县"}, {"c": "聂荣县"}, {"c": "安多县"}, {"c": "申扎县"}, {"c": "索县"}, {"c": "班戈县"}, {"c": "巴青县"}, {"c": "尼玛县"}, {"c": "双湖县"}]
      }, {
        "c": "阿里地区",
        "d": [{"c": "普兰县"}, {"c": "札达县"}, {"c": "噶尔县"}, {"c": "日土县"}, {"c": "革吉县"}, {"c": "改则县"}, {"c": "措勤县"}]
      }]
    }, {
      "c": "陕西省",
      "d": [{
        "c": "西安市",
        "d": [{"c": "新城区"}, {"c": "碑林区"}, {"c": "莲湖区"}, {"c": "灞桥区"}, {"c": "未央区"}, {"c": "雁塔区"}, {"c": "阎良区"}, {"c": "临潼区"}, {"c": "长安区"}, {"c": "高陵区"}, {"c": "鄠邑区"}, {"c": "蓝田县"}, {"c": "周至县"}]
      }, {"c": "铜川市", "d": [{"c": "王益区"}, {"c": "印台区"}, {"c": "耀州区"}, {"c": "宜君县"}]}, {
        "c": "宝鸡市",
        "d": [{"c": "渭滨区"}, {"c": "金台区"}, {"c": "陈仓区"}, {"c": "凤翔县"}, {"c": "岐山县"}, {"c": "扶风县"}, {"c": "眉县"}, {"c": "陇县"}, {"c": "千阳县"}, {"c": "麟游县"}, {"c": "凤县"}, {"c": "太白县"}]
      }, {
        "c": "咸阳市",
        "d": [{"c": "秦都区"}, {"c": "杨陵区"}, {"c": "渭城区"}, {"c": "三原县"}, {"c": "泾阳县"}, {"c": "乾县"}, {"c": "礼泉县"}, {"c": "永寿县"}, {"c": "彬县"}, {"c": "长武县"}, {"c": "旬邑县"}, {"c": "淳化县"}, {"c": "武功县"}, {"c": "兴平市"}]
      }, {
        "c": "渭南市",
        "d": [{"c": "临渭区"}, {"c": "华州区"}, {"c": "潼关县"}, {"c": "大荔县"}, {"c": "合阳县"}, {"c": "澄城县"}, {"c": "蒲城县"}, {"c": "白水县"}, {"c": "富平县"}, {"c": "韩城市"}, {"c": "华阴市"}]
      }, {
        "c": "延安市",
        "d": [{"c": "宝塔区"}, {"c": "安塞区"}, {"c": "延长县"}, {"c": "延川县"}, {"c": "子长县"}, {"c": "志丹县"}, {"c": "吴起县"}, {"c": "甘泉县"}, {"c": "富县"}, {"c": "洛川县"}, {"c": "宜川县"}, {"c": "黄龙县"}, {"c": "黄陵县"}]
      }, {
        "c": "汉中市",
        "d": [{"c": "汉台区"}, {"c": "南郑区"}, {"c": "城固县"}, {"c": "洋县"}, {"c": "西乡县"}, {"c": "勉县"}, {"c": "宁强县"}, {"c": "略阳县"}, {"c": "镇巴县"}, {"c": "留坝县"}, {"c": "佛坪县"}]
      }, {
        "c": "榆林市",
        "d": [{"c": "榆阳区"}, {"c": "横山区"}, {"c": "府谷县"}, {"c": "靖边县"}, {"c": "定边县"}, {"c": "绥德县"}, {"c": "米脂县"}, {"c": "佳县"}, {"c": "吴堡县"}, {"c": "清涧县"}, {"c": "子洲县"}, {"c": "神木市"}]
      }, {
        "c": "安康市",
        "d": [{"c": "汉滨区"}, {"c": "汉阴县"}, {"c": "石泉县"}, {"c": "宁陕县"}, {"c": "紫阳县"}, {"c": "岚皋县"}, {"c": "平利县"}, {"c": "镇坪县"}, {"c": "旬阳县"}, {"c": "白河县"}]
      }, {
        "c": "商洛市",
        "d": [{"c": "商州区"}, {"c": "洛南县"}, {"c": "丹凤县"}, {"c": "商南县"}, {"c": "山阳县"}, {"c": "镇安县"}, {"c": "柞水县"}]
      }]
    }, {
      "c": "甘肃省",
      "d": [{
        "c": "兰州市",
        "d": [{"c": "城关区"}, {"c": "七里河区"}, {"c": "西固区"}, {"c": "安宁区"}, {"c": "红古区"}, {"c": "永登县"}, {"c": "皋兰县"}, {"c": "榆中县"}]
      }, {"c": "嘉峪关市", "d": [{"c": "市辖区"}]}, {"c": "金昌市", "d": [{"c": "金川区"}, {"c": "永昌县"}]}, {
        "c": "白银市",
        "d": [{"c": "白银区"}, {"c": "平川区"}, {"c": "靖远县"}, {"c": "会宁县"}, {"c": "景泰县"}]
      }, {
        "c": "天水市",
        "d": [{"c": "秦州区"}, {"c": "麦积区"}, {"c": "清水县"}, {"c": "秦安县"}, {"c": "甘谷县"}, {"c": "武山县"}, {"c": "张家川回族自治县"}]
      }, {"c": "武威市", "d": [{"c": "凉州区"}, {"c": "民勤县"}, {"c": "古浪县"}, {"c": "天祝藏族自治县"}]}, {
        "c": "张掖市",
        "d": [{"c": "甘州区"}, {"c": "肃南裕固族自治县"}, {"c": "民乐县"}, {"c": "临泽县"}, {"c": "高台县"}, {"c": "山丹县"}]
      }, {
        "c": "平凉市",
        "d": [{"c": "崆峒区"}, {"c": "泾川县"}, {"c": "灵台县"}, {"c": "崇信县"}, {"c": "华亭县"}, {"c": "庄浪县"}, {"c": "静宁县"}]
      }, {
        "c": "酒泉市",
        "d": [{"c": "肃州区"}, {"c": "金塔县"}, {"c": "瓜州县"}, {"c": "肃北蒙古族自治县"}, {"c": "阿克塞哈萨克族自治县"}, {"c": "玉门市"}, {"c": "敦煌市"}]
      }, {
        "c": "庆阳市",
        "d": [{"c": "西峰区"}, {"c": "庆城县"}, {"c": "环县"}, {"c": "华池县"}, {"c": "合水县"}, {"c": "正宁县"}, {"c": "宁县"}, {"c": "镇原县"}]
      }, {
        "c": "定西市",
        "d": [{"c": "安定区"}, {"c": "通渭县"}, {"c": "陇西县"}, {"c": "渭源县"}, {"c": "临洮县"}, {"c": "漳县"}, {"c": "岷县"}]
      }, {
        "c": "陇南市",
        "d": [{"c": "武都区"}, {"c": "成县"}, {"c": "文县"}, {"c": "宕昌县"}, {"c": "康县"}, {"c": "西和县"}, {"c": "礼县"}, {"c": "徽县"}, {"c": "两当县"}]
      }, {
        "c": "临夏回族自治州",
        "d": [{"c": "临夏市"}, {"c": "临夏县"}, {"c": "康乐县"}, {"c": "永靖县"}, {"c": "广河县"}, {"c": "和政县"}, {"c": "东乡族自治县"}, {"c": "积石山保安族东乡族撒拉族自治县"}]
      }, {
        "c": "甘南藏族自治州",
        "d": [{"c": "合作市"}, {"c": "临潭县"}, {"c": "卓尼县"}, {"c": "舟曲县"}, {"c": "迭部县"}, {"c": "玛曲县"}, {"c": "碌曲县"}, {"c": "夏河县"}]
      }]
    }, {
      "c": "青海省",
      "d": [{
        "c": "西宁市",
        "d": [{"c": "城东区"}, {"c": "城中区"}, {"c": "城西区"}, {"c": "城北区"}, {"c": "大通回族土族自治县"}, {"c": "湟中县"}, {"c": "湟源县"}]
      }, {
        "c": "海东市",
        "d": [{"c": "乐都区"}, {"c": "平安区"}, {"c": "民和回族土族自治县"}, {"c": "互助土族自治县"}, {"c": "化隆回族自治县"}, {"c": "循化撒拉族自治县"}]
      }, {"c": "海北藏族自治州", "d": [{"c": "门源回族自治县"}, {"c": "祁连县"}, {"c": "海晏县"}, {"c": "刚察县"}]}, {
        "c": "黄南藏族自治州",
        "d": [{"c": "同仁县"}, {"c": "尖扎县"}, {"c": "泽库县"}, {"c": "河南蒙古族自治县"}]
      }, {"c": "海南藏族自治州", "d": [{"c": "共和县"}, {"c": "同德县"}, {"c": "贵德县"}, {"c": "兴海县"}, {"c": "贵南县"}]}, {
        "c": "果洛藏族自治州",
        "d": [{"c": "玛沁县"}, {"c": "班玛县"}, {"c": "甘德县"}, {"c": "达日县"}, {"c": "久治县"}, {"c": "玛多县"}]
      }, {
        "c": "玉树藏族自治州",
        "d": [{"c": "玉树市"}, {"c": "杂多县"}, {"c": "称多县"}, {"c": "治多县"}, {"c": "囊谦县"}, {"c": "曲麻莱县"}]
      }, {"c": "海西蒙古族藏族自治州", "d": [{"c": "格尔木市"}, {"c": "德令哈市"}, {"c": "乌兰县"}, {"c": "都兰县"}, {"c": "天峻县"}]}]
    }, {
      "c": "宁夏回族自治区",
      "d": [{
        "c": "银川市",
        "d": [{"c": "兴庆区"}, {"c": "西夏区"}, {"c": "金凤区"}, {"c": "永宁县"}, {"c": "贺兰县"}, {"c": "灵武市"}]
      }, {"c": "石嘴山市", "d": [{"c": "大武口区"}, {"c": "惠农区"}, {"c": "平罗县"}]}, {
        "c": "吴忠市",
        "d": [{"c": "利通区"}, {"c": "红寺堡区"}, {"c": "盐池县"}, {"c": "同心县"}, {"c": "青铜峡市"}]
      }, {"c": "固原市", "d": [{"c": "原州区"}, {"c": "西吉县"}, {"c": "隆德县"}, {"c": "泾源县"}, {"c": "彭阳县"}]}, {
        "c": "中卫市",
        "d": [{"c": "沙坡头区"}, {"c": "中宁县"}, {"c": "海原县"}]
      }]
    }, {
      "c": "新疆维吾尔自治区",
      "d": [{
        "c": "乌鲁木齐市",
        "d": [{"c": "天山区"}, {"c": "沙依巴克区"}, {"c": "新市区"}, {"c": "水磨沟区"}, {"c": "头屯河区"}, {"c": "达坂城区"}, {"c": "米东区"}, {"c": "乌鲁木齐县"}]
      }, {"c": "克拉玛依市", "d": [{"c": "独山子区"}, {"c": "克拉玛依区"}, {"c": "白碱滩区"}, {"c": "乌尔禾区"}]}, {
        "c": "吐鲁番市",
        "d": [{"c": "高昌区"}, {"c": "鄯善县"}, {"c": "托克逊县"}]
      }, {"c": "哈密市", "d": [{"c": "伊州区"}, {"c": "巴里坤哈萨克自治县"}, {"c": "伊吾县"}]}, {
        "c": "昌吉回族自治州",
        "d": [{"c": "昌吉市"}, {"c": "阜康市"}, {"c": "呼图壁县"}, {"c": "玛纳斯县"}, {"c": "奇台县"}, {"c": "吉木萨尔县"}, {"c": "木垒哈萨克自治县"}]
      }, {"c": "博尔塔拉蒙古自治州", "d": [{"c": "博乐市"}, {"c": "阿拉山口市"}, {"c": "精河县"}, {"c": "温泉县"}]}, {
        "c": "巴音郭楞蒙古自治州",
        "d": [{"c": "库尔勒市"}, {"c": "轮台县"}, {"c": "尉犁县"}, {"c": "若羌县"}, {"c": "且末县"}, {"c": "焉耆回族自治县"}, {"c": "和静县"}, {"c": "和硕县"}, {"c": "博湖县"}]
      }, {
        "c": "阿克苏地区",
        "d": [{"c": "阿克苏市"}, {"c": "温宿县"}, {"c": "库车县"}, {"c": "沙雅县"}, {"c": "新和县"}, {"c": "拜城县"}, {"c": "乌什县"}, {"c": "阿瓦提县"}, {"c": "柯坪县"}]
      }, {"c": "克孜勒苏柯尔克孜自治州", "d": [{"c": "阿图什市"}, {"c": "阿克陶县"}, {"c": "阿合奇县"}, {"c": "乌恰县"}]}, {
        "c": "喀什地区",
        "d": [{"c": "喀什市"}, {"c": "疏附县"}, {"c": "疏勒县"}, {"c": "英吉沙县"}, {"c": "泽普县"}, {"c": "莎车县"}, {"c": "叶城县"}, {"c": "麦盖提县"}, {"c": "岳普湖县"}, {"c": "伽师县"}, {"c": "巴楚县"}, {"c": "塔什库尔干塔吉克自治县"}]
      }, {
        "c": "和田地区",
        "d": [{"c": "和田市"}, {"c": "和田县"}, {"c": "墨玉县"}, {"c": "皮山县"}, {"c": "洛浦县"}, {"c": "策勒县"}, {"c": "于田县"}, {"c": "民丰县"}]
      }, {
        "c": "伊犁哈萨克自治州",
        "d": [{"c": "伊宁市"}, {"c": "奎屯市"}, {"c": "霍尔果斯市"}, {"c": "伊宁县"}, {"c": "察布查尔锡伯自治县"}, {"c": "霍城县"}, {"c": "巩留县"}, {"c": "新源县"}, {"c": "昭苏县"}, {"c": "特克斯县"}, {"c": "尼勒克县"}]
      }, {
        "c": "塔城地区",
        "d": [{"c": "塔城市"}, {"c": "乌苏市"}, {"c": "额敏县"}, {"c": "沙湾县"}, {"c": "托里县"}, {"c": "裕民县"}, {"c": "和布克赛尔蒙古自治县"}]
      }, {
        "c": "阿勒泰地区",
        "d": [{"c": "阿勒泰市"}, {"c": "布尔津县"}, {"c": "富蕴县"}, {"c": "福海县"}, {"c": "哈巴河县"}, {"c": "青河县"}, {"c": "吉木乃县"}]
      }, {"c": "石河子市", "d": [{"c": "市辖区"}]}, {"c": "阿拉尔市", "d": [{"c": "市辖区"}]}, {
        "c": "图木舒克市",
        "d": [{"c": "市辖区"}]
      }, {"c": "五家渠市", "d": [{"c": "市辖区"}]}, {"c": "北屯市", "d": [{"c": "市辖区"}]}, {
        "c": "铁门关市",
        "d": [{"c": "市辖区"}]
      }, {"c": "双河市", "d": [{"c": "市辖区"}]}, {"c": "可克达拉市", "d": [{"c": "市辖区"}]}, {"c": "昆玉市", "d": [{"c": "市辖区"}]}]
    }];

}(Zepto);
// jshint ignore: end
